import { v4 as uuidv4 } from "uuid";
export const donatoesService = {
  query,
};

function query(filterBy) {
  let donators = gDonators;
  if (filterBy) {
    donators = gDonators.filter((donator) =>
      donator.fullname.toLowerCase().includes(filterBy) || 
      donator.fullname.toUpperCase().includes(filterBy) 
      );
    }
    return [...donators];
}

const gDonators = [
  {
    fullname: "עודד אלפסי",
    id: uuidv4(),
    txt: "לע״נ ברוך לוי בן ג׳ורגיה",
  },
  {
    fullname: "שראל גבאי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "לימור, אשחר ועמליה נחמני",
    id: uuidv4(),
    txt: "לע״נ אושר בן חנן וחנה נחמני. נפטר כא בניסן, שביעי של פסח תשעא",
  },
  {
    fullname: "אבי ואורה קפלן",
    id: uuidv4(),
    txt: "לזכר הורינו רבי יצחק דוד קפלן ואשתו ברכה לבית זמורה ורבי שמואל אברהם סלומון ואשתו גוסטל לבית הויזמן",
  },
  {
    fullname: "יחזקאל היימן יהושע",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "צבי איל גולדשטיין",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלונה בת מירה",
    id: uuidv4(),
    txt: "לזיווג הגון ובנין עדי עד",
  },
  {
    fullname: "אלחנן זוננפלד",
    id: uuidv4(),
    txt: "לע״נ אמי רחל בת אלחנן זאב ז״ל",
  },
  {
    fullname: "אלינור ויהונתן בן סימון",
    id: uuidv4(),
    txt: "לזכות בניה בן אלינור וללידה קלה כתרנגולת",
  },
  {
    fullname: "אמנון אהרונוב",
    id: uuidv4(),
    txt: 'לזכר הורי ז"ל- מור אבי בוריס הן הרב דוד הכהן ומאת אימי מזל בת שושנה',
  },
  {
    fullname: "אשרת ואופיר כהן",
    id: uuidv4(),
    txt: "לרפואה ואריכות ימים ולסגולה בת מזל",
  },
  {
    fullname: "אורה שמחה בת תראכי",
    id: uuidv4(),
    txt: "בריאות אריכות ימים ושנים מתוך בריאות ושובע שמחות ויקויים בי דור ישרים יבורך",
  },
  {
    fullname: "שי לביא",
    id: uuidv4(),
    txt: "בעזרת השם לאחדות כל ישראל",
  },
  {
    fullname: "יואבה שלמה",
    id: uuidv4(),
    txt: "לעילוי נשמת הוריי סעידה מזל בת הרב אברהם וישראל בן רבי חיים, לחזרה בתשובה וזרע של קיימה לילדיי רעות ונריה",
  },
  {
    fullname: "דורון פינקלשטיין",
    id: uuidv4(),
    txt: "רפואה ובריאות",
  },
  {
    fullname: "דליה ואלכסנדר יעקב אייזנשטדט",
    id: uuidv4(),
    txt: "לעילוי נשמת בתיה בת רחל ואפרים בן רחל",
  },
  {
    fullname: "מזל נפשי",
    id: uuidv4(),
    txt: "לרפואת הגוף והנפש לאמיר בן מזל ולהבדיל, לעילוי נשמת יצחק חיים בן מירב ויחזקאל",
  },
  {
    fullname: "ורדית ונתנאל מזרחי",
    id: uuidv4(),
    txt: "לרפואת והצלחת הלל אסתר בת ורדית",
  },
  {
    fullname: "חנוך ומורן כהן",
    id: uuidv4(),
    txt: "לזרע בר קיימא",
  },
  {
    fullname: "צפנת שלום",
    id: uuidv4(),
    txt: "לבריאות והצלחה בלימודים ובכל",
  },
  {
    fullname: "יוסף ברוכים",
    id: uuidv4(),
    txt: "יהודית בת שולמית לכל הישעות",
  },
  {
    fullname: "יובל אטיאס",
    id: uuidv4(),
    txt: "לזכות יובל בן אסתר, הילה בת מזל, יעל מזל בת הילה, אפרת אסתר בת הילה, יאיר הן הילה, אליה בן הילה למשפחת אטיאס",
  },
  {
    fullname: "יעקב ובת שבע בנימין",
    id: uuidv4(),
    txt: " לעילוי נשמת אבי בנימין בן חנה",
  },
  {
    fullname: "יצחק (איצ'ה) כהן",
    id: uuidv4(),
    txt: "לעילוי נשמת רעייתי נורית כהן ז״ל שנפטרה בטרם עת ושנזכה לבשורות טובות אמן",
  },
  {
    fullname: "יונתן אזרזר",
    id: uuidv4(),
    txt: " לעילוי נשמת יצחק אזרזר בן חביבה",
  },
  {
    fullname: "יצחק אלדר בן שרה הגר לבית בנבט",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אברהם בן חמו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אודי ודורית אליהו",
    id: uuidv4(),
    txt: "לבריאות ושלומם של חיילי צה״ל וכל עם ישראל",
  },
  {
    fullname: "עמנואל ואריאלה לוי",
    id: uuidv4(),
    txt: "לברכה והצלחה",
  },
  {
    fullname: "זוהרה קלמן לוי",
    id: uuidv4(),
    txt: "להוריי נתן לוי לוחם חירות ישראל בירושלים ורבקה לוי",
  },
  {
    fullname: "חיים ואורה לדיוב",
    id: uuidv4(),
    txt: "להצלחה בגשמיות ובפרט ברוחניות למשפחה",
  },
  {
    fullname: "עמי שרביט",
    id: uuidv4(),
    txt: "להצלחה בכל הענינים ליחיעם בן דינה, לעילוי אהרון בר שמחה, רחל בר מסעודה, רבי יחיא בר אסתר, ימנה פרחה ולרפואת אמי רחל בת רותי",
  },
  {
    fullname: "משפחת נקש",
    id: uuidv4(),
    txt: "להצלחה, בריאות, שלום בית, חינוך ילדים ופרנסה טובה, כל הישועות למשפחת נקש",
  },
  {
    fullname: "ידגראן רוברט",
    id: uuidv4(),
    txt: "להצלחת ידגראן רוברט ומשפחתו",
  },
  {
    fullname: "ארז והדר צפרי",
    id: uuidv4(),
    txt: "להצלחת ארז והדר צפרי וכל משפחתם בכל העניינים ולע״נ ציון חסן בן ליזה",
  },
  {
    fullname: "דוד אברהם יצחק",
    id: uuidv4(),
    txt: "להצלחת דוד אברהם יצחק בן בת שבע רות וב״ב בכל",
  },
  {
    fullname: "מיטל מזל",
    id: uuidv4(),
    txt: "להצלחת מיטל מזל בת יפה בכל",
  },
  {
    fullname: "מיקי מקיקס",
    id: uuidv4(),
    txt: "להצלחת מיקי מקיקס בן שושנה עזרא וב״ב",
  },
  {
    fullname: "מיכאל בן דדה",
    id: uuidv4(),
    txt: "להצלחת מיכאל בן דדה ומשפחתו",
  },
  {
    fullname: "משפחת בכר",
    id: uuidv4(),
    txt: "להצלחת משפחת בכר",
  },
  {
    fullname: "מנחם הרטמן",
    id: uuidv4(),
    txt: "להצלחת משפחת וילהלם שיחי",
  },
  {
    fullname: "איציק ימין",
    id: uuidv4(),
    txt: "להצלחת משפחת ימין ולעילוי נשמת אליהו בן נעימה",
  },
  {
    fullname: "עדנה בת דייזי",
    id: uuidv4(),
    txt: "להצלחת משפחת עדנה בת דייזי",
  },
  {
    fullname: "ניר נתן בן שמאי",
    id: uuidv4(),
    txt: "להצלחת ניר נתן בן שמאי ובני ביתו",
  },
  {
    fullname: "אלון ונק",
    id: uuidv4(),
    txt: "להצלחת עם ישראל",
  },
  {
    fullname: "אבי אברהם",
    id: uuidv4(),
    txt: "להצלחת עם ישראל וחיילי צה״ל",
  },
  {
    fullname: "דב ומירב שאול",
    id: uuidv4(),
    txt: "לעילוי נשמת יצחק חיים בן מירב",
  },
  {
    fullname: "יואל רדעי",
    id: uuidv4(),
    txt: "לזיווג מהיר למיכל בת יואל רדעי ולחן בת אופירה סולמי",
  },
  {
    fullname: "נעמי קירש",
    id: uuidv4(),
    txt: "לזיווג משורש הנשמה במהרה ממש ובבריאות לבתנו שרה בת נעמי ומרדכי. לעילוי נשמת הורי: חיים בן יעקב ומניה-חיה מלכה בת דב-בעריש",
  },
  {
    fullname: "מאיר ניסים וצליל כהן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "גילה בת לאה",
    id: uuidv4(),
    txt: "לזכות גילה בת לאה, חדרך בן יוכבד ז״ל, שקד בן גילה, שגיא בן גילה, רועי בן גילה",
  },
  {
    fullname: "אבבה מהרט",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "איתמר ונטע אברקי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלון ונדיה בן מרדכי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלי ועליה שקרצי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אליעזר אריה קורנפלד",
    id: uuidv4(),
    txt: "לזכות אליעזר אריה בן רות ולזכות אמי רות בת חנה",
  },
  {
    fullname: "אסתר רפיעי בת שרה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אתי כהן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ליאת שגיב היקרי",
    id: uuidv4(),
    txt: "לזכות בנותיי היקרות טליה, נטי ואדר בנות ליאת. לזיווג הגון משורש נשמתן והקמת בית נאמן בישראל, בניין עדי עד ולזכות עם ישראל כולו",
  },
  {
    fullname: "חיה נדב",
    id: uuidv4(),
    txt: "לזכות בעלי אילן בן מזל",
  },
  {
    fullname: "ברוכים יחיאל ורחל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "גלעד בן דרורה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דוד מרדכי טויטו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מאור חי הלוי",
    id: uuidv4(),
    txt: "לזכות דניאל בן רינה",
  },
  {
    fullname: "שילת דנינו",
    id: uuidv4(),
    txt: "לזכות דנית בת רות ורועי בן רונית - לפרי בטן",
  },
  {
    fullname: "דפנה ושלמה צלליכין",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "לירן שרעבי",
    id: uuidv4(),
    txt: "לזכות ההורים שלי, דניאל ואריאלה שרעבי",
  },
  {
    fullname: "אהוד שרעבי",
    id: uuidv4(),
    txt: "לזכות הוריי היקרים רוני בן רהב ומרים בת אבוסעוד, שאלוהים ישמרם וישלח להם בריאות איתנה",
  },
  {
    fullname: "הרצל וכוכבה מגן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוכבד צפורה ואיתמר פריימרק",
    id: uuidv4(),
    txt: "לזכות ולהצלחת בננו אוריה ואליאב בן יוכבד צפורה ואיתמר",
  },
  {
    fullname: "חגית בוני-נח",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "חן בן טובה מליחי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יהונתן גוטמן",
    id: uuidv4(),
    txt: "לזכות חנה בת רחל יוכבד",
  },
  {
    fullname: "יגאל יוסף",
    id: uuidv4(),
    txt: "לזכות יגאל יוסף ולכל משפחתו להצלחה ולבריאות",
  },
  {
    fullname: "יואב שמאי",
    id: uuidv4(),
    txt: "לזכות יואב בן טובה שמאי, לזיווג עם אישה יראת ה במהרה ולהקמת בית עם טהרה קדושה שלום בית ושמחה",
  },
  {
    fullname: "יואל דיל",
    id: uuidv4(),
    txt: "לזכות יואל דיל ומשפחתו",
  },
  {
    fullname: "יוכי ומאיר צחור",
    id: uuidv4(),
    txt: "לזכות יוכי ומאיר צחור ובני ביתם מבית גמליאל",
  },
  {
    fullname: "יחיאל בן יששכר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יפתח בן נצחיה ויאיר צורף",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מאיה וחגי בן אברהם",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יהודה בן חור",
    id: uuidv4(),
    txt: "לזכות מורן בת שושנה להיריון תקין ולידה קלה ולזכות הילדים שירה בת מורן, שילת בת מורן, יוסף יצחק בן מורן. נחת חסידי מהם",
  },
  {
    fullname: "מורן בן גיאת",
    id: uuidv4(),
    txt: "לזכות מורן מרלין בת פורטונה לבנה, ולעילוי נשמת סבי וסבתי אברהם אלברט בן זהרה מרייט מרלין בת פורטונה",
  },
  {
    fullname: "מיכאל פינטו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מיקי ואלברט בראל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מרדכי וקנין ורוזה גמזו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אברהם קליין",
    id: uuidv4(),
    txt: "לזכות משפחות קליין, וינטר והירשקורן, לבריאות ואריכות ימים, נחת והצלחה בכל",
  },
  {
    fullname: "משפחת אוהב עמי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "בת שבע ומתן ארביב",
    id: uuidv4(),
    txt: "לזכות משפחת ארביב, בת שבע בת דינה ומתן בן יהודית, וילדיהם לביא יוסף בן בת שבע ואריאל בן בת שבע",
  },
  {
    fullname: "משפחת וילנר",
    id: uuidv4(),
    txt: "לזכות משפחת וילנר: רוני ניר מלי תמר מטילדה יהונתן יוסף איתי יהודה",
  },
  {
    fullname: "משפחת טהר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "משפחת טרייגר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "משפחת ירדן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אושריה סלע",
    id: uuidv4(),
    txt: "לזכות משפחת סלע, לעילוי נשמת אבי- אריה בן רות ודוד ולעילוי נשמת יורם בן זהרה וישראל",
  },
  {
    fullname: "משפחת פלפלי",
    id: uuidv4(),
    txt: "לזכות משפחת פלפלי והצלחתם",
  },
  {
    fullname: "משפחת קדוש",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אמיר קולברג",
    id: uuidv4(),
    txt: "לזכות משפחת קולברג ולעילוי נשמת בינה שולמית קולברג",
  },
  {
    fullname: "משפחת רופא חיים",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "משפחת שטראוס",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נאוה ועדו אורלוב",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נטלי ואמיר חורב",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ניר קבלו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עדי קארן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "משה שלמה",
    id: uuidv4(),
    txt: "לזכות עדי שלמה בת יפה ולעילוי נשמת מוריס בן מרימה",
  },
  {
    fullname: "סיגל בוכריס",
    id: uuidv4(),
    txt: "לזכות עדן שני ונתנאל בוכריס",
  },
  {
    fullname: "עודד ואוראל אליאס",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עמנואל דמתי",
    id: uuidv4(),
    txt: "לזכות עמנואל דמתי ומשפחתו, בריאות והצלחה",
  },
  {
    fullname: "עמנואל ונאוה סלם",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עמרם פינטו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "פטריסיה וטל יהודה מדיוני",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "צדוק יחזקאל בן כתון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "צחי וכינרת דקל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רויטל בת חדוה",
    id: uuidv4(),
    txt: "לזכות רויטל בת חדוה לכל הישועות",
  },
  {
    fullname: "רוני ולילך שניידר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שי ומימי יעקובוב",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שלומי בן צביה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שלמה חיים וחנה ברונשטיין",
    id: uuidv4(),
    txt: "לזכות שלמה חיים וחנה ברונשטיין ומשפחתם",
  },
  {
    fullname: "שרי ואיציק בר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אילן כץ",
    id: uuidv4(),
    txt: "לזכר אבי המנוח שלום בן רבי שמואל הכהן כ״ץ",
  },
  {
    fullname: "איתן בר און",
    id: uuidv4(),
    txt: "לזכר אשר דויטש ז״ל",
  },
  {
    fullname: "אסתר ביטון",
    id: uuidv4(),
    txt: "לזכרו של בני שנפל במבצע צוק איתן- מימון מידן ביטון",
  },
  {
    fullname: "אברהם דוד עמר",
    id: uuidv4(),
    txt: "לזכרו של יוסי בן מרים ז״ל",
  },
  {
    fullname: "שלומית ויאיר עפג׳ין",
    id: uuidv4(),
    txt: "לע״נ נזיהא בת ריחנה גואטה נלב״ע כ״ו מנחם אב תשע״ח, אביגדור ויטו חואטו בן נזיהא גואטה נלב״ע ט״ו תשרי תשע״ט, רומיה עפג׳ין בת אברהם ז״ל נפטרה ג׳ תשרי התשע״ד, יששכר עפג׳ין  בן יחיא ז״ל נפטר כג׳ שבט התש״ע",
  },
  {
    fullname: "אפרת ובנימין זרביב",
    id: uuidv4(),
    txt: "לכבוד הגאולה האמתית והשלימה תיכף ומיד ממש!",
  },
  {
    fullname: "דניאל זנג",
    id: uuidv4(),
    txt: "לע״נ אפרים דוד בן ג׳רלד זנג",
  },
  {
    fullname: "יענקלה קרוגליאק",
    id: uuidv4(),
    txt: "לע״נ בנינו היקר אריק (אהרן מרדכי) הי״ד אשר נרצח ב כ״ד אדר תשס״ב מידי מחבל ערבי, עת שלמד בישיבה-מכינה קדם צבאית בעצמונה",
  },
  {
    fullname: "אילה יעקובי",
    id: uuidv4(),
    txt: "לע״נ הורי שמואל וחנה יעקובי, אחי יוסף יעקובי, ואחיותי שושנה בר מוחא ואביבה פדידה. ברכה והצלחה לביתי חנה ובעלה מאור יצחק חיון והילדים עתי אברהם ואלה אנט",
  },
  {
    fullname: "ר׳ שמחה ישראל הכהן ויהודית דבורה כהן",
    id: uuidv4(),
    txt: "לע״נ הר״ר בנימין הכהן בן ר׳ יהודה יוסף הכהן זצ״ל כ״ץ ",
  },
  {
    fullname: "יוסף מאיר איגל",
    id: uuidv4(),
    txt: "לע״נ הרה״ח אליעזר בהרה״ח אברהם יעקב (מוזס), לע״נ הרה״ח אברהם דוב בהרה״ח נפתלי חיים (איגל), לזכות הרב יוסף חיים קאנטור ומשפחתו, לזכות הרב נחמיה וילהלם ומשפחתו",
  },
  {
    fullname: "בני ותהילה מרקוביץ",
    id: uuidv4(),
    txt: "לע״נ חיה ליבא בת יצחק",
  },
  {
    fullname: "מאור זמיר",
    id: uuidv4(),
    txt: "לע״נ חיים זוסמן, לע״נ ניסים לומברוזו, לע״נ מזל טוב לומברוזו",
  },
  {
    fullname: "רועי ונטע מרילי",
    id: uuidv4(),
    txt: "לע״נ חסידה בת רינה ז״ל ",
  },
  {
    fullname: "שחר נידאם",
    id: uuidv4(),
    txt: "לע״נ לטיפה מגידנה ז״ל בת רזול וסאלח הלויים ע״ה",
  },
  {
    fullname: "יניב שלום",
    id: uuidv4(),
    txt: "לע״נ מלכה בת הנרי אהרן ורחל",
  },
  {
    fullname: "רחל וולף",
    id: uuidv4(),
    txt: "לעילוי נישמת אבי ז״ל עזרא בן רחל",
  },
  {
    fullname: "חיים שניידר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יהודית ואלי פדידה",
    id: uuidv4(),
    txt: "לעילוי נישמת אבי עזיז בן לילה ואימי מחרוסה בת פרחה (אמא שנפטרה בהיותי בת 3) ואימי דינה בת בת שבע (האמא שגידלה אותי)",
  },
  {
    fullname: "גואל דוידיאן",
    id: uuidv4(),
    txt: "לעילוי נשמת עזריה בן מרים ושרה בת גוהאר",
  },
  {
    fullname: "אלון פרץ",
    id: uuidv4(),
    txt: "לעילוי נשמתה של שלומית פרץ שבחייה אהבה את העשייה של הרב נחמיה וכל העוסקים במלאכה המבורכת",
  },
  {
    fullname: "דרור ותארי",
    id: uuidv4(),
    txt: "לעילוי נשמות טהורות יוסף ותארי ושלמה ענקי",
  },
  {
    fullname: "ליאורה ואייל חן",
    id: uuidv4(),
    txt: "לעילוי נשמות יוסף חן, בלומה וחיים שני",
  },
  {
    fullname: "עובדיה לוי",
    id: uuidv4(),
    txt: "לעילוי נשמותיהם של מקסים ניסים לוי בן מסעודה, שמואל כהן בן עזיזה, רחמה כהן בת עיישה. לבריאותם הצלחתם וברכתם של כל משפחות לוי וכהן",
  },
  {
    fullname: "אפרת שטרהל",
    id: uuidv4(),
    txt: "לעילוי נשמת לוחם ימ״מ נעם בן ישעיהו רז הי״ד שנהרג על קידוש ה׳ ושמירת עמנו",
  },
  {
    fullname: "יחיאל ונעמי רחמים",
    id: uuidv4(),
    txt: "לעילוי נשמת משה מרדכי הכהן בן יצחק ברכה בת לאה עדנה בת ברכה",
  },
  {
    fullname: "שלמה גבאי",
    id: uuidv4(),
    txt: "לעילוי נשמת אברהם אלברט בן שלמה",
  },
  {
    fullname: "ראודור ומזל מנור",
    id: uuidv4(),
    txt: "לעילוי נשמת  אינס וגבריאל אמירא ז״ל, רחל מנור ז״ל, אבי גבאי ז״ל",
  },
  {
    fullname: "חן גיספאן",
    id: uuidv4(),
    txt: "לעילוי נשמת חבצלת בת שרה צפריר בן ברוריה. לזיווג הגון- חן בת חבצלת בתוך שאר רווקי ורווקות עם ישראל",
  },
  {
    fullname: "רני רבין",
    id: uuidv4(),
    txt: "לעילוי נשמת רוזי רוזט שושנה בת פרידה ע״ה למשפחת רבין",
  },
  {
    fullname: "שלמה וסבינה לוי",
    id: uuidv4(),
    txt: "לעילוי נשמת מתילדה בת רחל ואריה בן מתילדה",
  },
  {
    fullname: "אלעד ונטע קורן ",
    id: uuidv4(),
    txt: "לעילוי נשמת - יואל רחמים בן רחל, לזכות הילדים שיחיו החיילים בצבאות ה׳ - נעמי, יעל, הדסה, מנחם מענדל ויוסף יצחק",
  },
  {
    fullname: "אשר פרץ",
    id: uuidv4(),
    txt: "לעילוי נשמת  אליהו מורסיאנו בן פרחה ואברהם ועליזה שריד בת עמם",
  },
  {
    fullname: "עובדיה חממה",
    id: uuidv4(),
    txt: "לעילוי נשמת אבי ז״ל מאיר חממה בן שמחה ויחזקאל",
  },
  {
    fullname: "מזל שרים",
    id: uuidv4(),
    txt: "לעילוי נשמת אבא שלי רבי מתתיהו עזרא בן מזל ,אב בית הדין ירושלים ",
  },
  {
    fullname: "אבי קדושים",
    id: uuidv4(),
    txt: "לעילוי נשמת אבי אליהו בן אברהם קדושים , ואימי , אהטרם בת קשוור קדושים",
  },
  {
    fullname: "גבריאל גרין",
    id: uuidv4(),
    txt: "לעילוי נשמת אבי גורדון גרין",
  },
  {
    fullname: "יעקב כהן",
    id: uuidv4(),
    txt: "לעילוי נשמת אבי יאיר בן מרים וחמי חיים אליהו בן  אהובה",
  },
  {
    fullname: "גילה פרץ",
    id: uuidv4(),
    txt: "לעילוי נשמת אבי מורי בנימין בן רג׳ילה. ולאריכות ימים בשובע לאימי מורתי טיטה בת רחימה",
  },
  {
    fullname: "יהודה הלפרין",
    id: uuidv4(),
    txt: "לעילוי נשמת אבי מורי הרב רפאל בן חיים יעקב זצ״ל ואימי מורתי ברטינה סימונה בת חנוך ע״ה הלפרין ",
  },
  {
    fullname: "יואל פוקס",
    id: uuidv4(),
    txt: "לעילוי נשמת אבי מורי הרב שמואל בן אהרן. ולעילוי נשמת אימי מורתי דבורה בת זאב ",
  },
  {
    fullname: "חיה בן עמי",
    id: uuidv4(),
    txt: "לעילוי נשמת אבי ראובן בן חתון ולזכות אימי שתחי׳ סבריה בת צ׳אחלה לזכות חיה בת סבריה",
  },
  {
    fullname: "עזריאל מדעי",
    id: uuidv4(),
    txt: "לעילוי נשמת אבי שלמה בן דוד מדעי, לעילוי נשמת אסף טספהון בן נגיסטה ",
  },
  {
    fullname: "עדינה גרינפלד",
    id: uuidv4(),
    txt: "לעילוי נשמת אברהם בן ציפורה ודב גרינפלד",
  },
  {
    fullname: "אריאל ירון",
    id: uuidv4(),
    txt: "לעילוי נשמת אברהם בן שרה",
  },
  {
    fullname: "שלמה והבה",
    id: uuidv4(),
    txt: "לעילוי נשמת אברהם ברומה בן נזלי רומנו, וורדה בת פורטונה והבה, בריאות לכל עם ישראל",
  },
  {
    fullname: "מקס חמו",
    id: uuidv4(),
    txt: "לעילוי נשמת אדיב אליהו בן חסנה, משה חמו בין עישה, חסיבה חמו בת מסעודה.  זיווג למשה מאור ועדיאל חמו בני מרגלית. זיווג לאדם סאידוב בן יפית. ברכה והצלחה ליפית ומקסו חמו. ולהילל יצחק בן שרה",
  },
  {
    fullname: "אסף הוכמן",
    id: uuidv4(),
    txt: "לעילוי נשמת אהרון ושרה הוכמן",
  },
  {
    fullname: "רעות אסולין",
    id: uuidv4(),
    txt: "לעילוי נשמת אודליה בת שבע בת שמואל ומרים",
  },
  {
    fullname: "אבנר נחשון",
    id: uuidv4(),
    txt: "לעילוי נשמת אחי דוד בן יונה נחשון ",
  },
  {
    fullname: "משה נאור",
    id: uuidv4(),
    txt: "לעילוי נשמת אימי ז״ל ברכה בת מרים",
  },
  {
    fullname: "רות אליעזר",
    id: uuidv4(),
    txt: "לעילוי נשמת אימי מורתי מרוסה דבורה בת שרבת",
  },
  {
    fullname: "שרה מיארה",
    id: uuidv4(),
    txt: "לעילוי נשמת אליהו בן איזה",
  },
  {
    fullname: "זהבית קהת",
    id: uuidv4(),
    txt: "לעילוי נשמת אמא שלי חנה בת לאה",
  },
  {
    fullname: "תמיר שפר ",
    id: uuidv4(),
    txt: "לעילוי נשמת אמי מורתי ראומה פרידה בת יעקב ולהבדיל לזכות אשתי איריס בת שרה ולזכות בניי עידן בן שרון, ברק בן שרון ,כפיר בן שרון, דולב בן שרון",
  },
  {
    fullname: "דוד ורות לינוי",
    id: uuidv4(),
    txt: "לעילוי נשמת אמיתי בן יוכבד",
  },
  {
    fullname: "לירז גל",
    id: uuidv4(),
    txt: "לעילוי נשמת אסתר בת מרים, סבתי היקרה ז״ל",
  },
  {
    fullname: "סיני פסל",
    id: uuidv4(),
    txt: "לעילוי נשמת אסתר ויצחק פסל ",
  },
  {
    fullname: "לינוי גולני",
    id: uuidv4(),
    txt: "לעילוי נשמת אפרים בן ידידה ויחיא",
  },
  {
    fullname: "יעקב דהאן",
    id: uuidv4(),
    txt: "לעילוי נשמת בנימין דהאן בן עישה, אביתר מאיר בן רחל, רחל בת קלרה",
  },
  {
    fullname: "יהודה ושרי כרייף",
    id: uuidv4(),
    txt: "לעילוי נשמת בנימין יונה בן זוריה ז״ל",
  },
  {
    fullname: "מיכל הראל",
    id: uuidv4(),
    txt: "לעילוי נשמת ברוך בן ורדה ולבריאות וחיים טובים וארוכים לרגינה בת חיסנה",
  },
  {
    fullname: "משה פריגן",
    id: uuidv4(),
    txt: "לעילוי נשמת בתיה ושאול פריגן, יסוד המעלה",
  },
  {
    fullname: "סימה אופיר מור",
    id: uuidv4(),
    txt: "לעילוי נשמת גבריאל בן שרה בוטראשוילי",
  },
  {
    fullname: "לאה ספסקי",
    id: uuidv4(),
    txt: "לעילוי נשמת דבורה ברכה בת חנה",
  },
  {
    fullname: "דורית ויהודה בינדר",
    id: uuidv4(),
    txt: "לעילוי נשמת דוד בן רוחמה, לעילוי נשמת מיכאל יוסף בן יהודה",
  },
  {
    fullname: "אבנר וקנין",
    id: uuidv4(),
    txt: "לעילוי נשמת דליה בת עליזה וקנין",
  },
  {
    fullname: "שני רוזנבלום",
    id: uuidv4(),
    txt: "לעילוי נשמת דניאל בן שני",
  },
  {
    fullname: "מזל פורטונה קשי",
    id: uuidv4(),
    txt: "לעילוי נשמת הוריי משה בן מסעודה ודינה בת שמחה. שמשון בן רוזה, יפה בת דינה, רינה אראלה בת דינה, יהודה בן דינה, דוד בן דינה",
  },
  {
    fullname: "אורלי כהן פלדמן",
    id: uuidv4(),
    txt: "לעילוי נשמת הוריי טוני בת מזל ומסעוד אשר וארטיגס מאוריציו משה בן רוזה רעיה ושלמה סולומון",
  },
  {
    fullname: "מירה קדוש",
    id: uuidv4(),
    txt: "לעילוי נשמת הורי היקרים עליזה בת חנה ושמעון בן תמו",
  },
  {
    fullname: "הרצל אביב",
    id: uuidv4(),
    txt: "לעילוי נשמת הוריי דניאל משלה בן מוריג'אן ולאה טאוס בת מונואר",
  },
  {
    fullname: "יעל עמוס",
    id: uuidv4(),
    txt: "לעילוי נשמת הוריי יוסף וזהרה עמוס ולעילוי נשמת רינה בת מזל",
  },
  {
    fullname: "אברהם קבסה",
    id: uuidv4(),
    txt: "לעילוי נשמת הוריי זיכרונם לברכה ,שמעון ואסתר קבסה ",
  },
  {
    fullname: "מוטי זינו",
    id: uuidv4(),
    txt: "לעילוי נשמת הוריי יהודה וסימי זינו ז״ל",
  },
  {
    fullname: "יהושע חיות",
    id: uuidv4(),
    txt: "לעילוי נשמת הורינו ז״ל עטי זיסל בת אברהם דב, משה לייב בן אברהם, מרגלית בת יול ושמעון בן יהושע צבי",
  },
  {
    fullname: "רבקה גולדשלגר",
    id: uuidv4(),
    txt: "לעילוי נשמת החסיד אשר בן שלמה זלמן ע״ה",
  },
  {
    fullname: "גאולה ואלי",
    id: uuidv4(),
    txt: "לעילוי נשמת הנערה חיה חנה קריאם ז״ל בת גאולה ואלי הי״ו ",
  },
  {
    fullname: "אביעד שחר",
    id: uuidv4(),
    txt: "לעילוי נשמת הסבתות שלנו- רחמה בת עישה ורבקה חיה בת מלכה",
  },
  {
    fullname: "יאיר אדרי",
    id: uuidv4(),
    txt: "לעילוי נשמת הרב אליקים אלוני בן פנינה תרנג׳ה ולעילוי נשמת רבי יעיש אדרי בן אסתר",
  },
  {
    fullname: "שמחה אברהם אשלג",
    id: uuidv4(),
    txt: "לעילוי נשמת הרבנית יודית חיה חנה בת הרב יצחק שמואל ע״ה נלב״ע כ׳ שבט תשפ״ב",
  },
  {
    fullname: "משה מוטי משעלי",
    id: uuidv4(),
    txt: "לעילוי נשמת ז׳נט בת סולטנה",
  },

  {
    fullname: "יעקב רזמוביץ",
    id: uuidv4(),
    txt: "לעילוי נשמת חיים שמואל בן מנחם מנדל בן לוי ולעילוי נשמת רינה בת רומיה",
  },
  {
    fullname: "שגב דגן",
    id: uuidv4(),
    txt: "לעילוי נשמת חנה בת חיה מרים לושק ז״ל,ולעילוי נשמת בני משפחתי אשר נרצחו בשואה, שלמה ברגמן בן מנשה ושרה,ישעיהו רובין בן נפתלי ושיינדל,דוד ברגמן בן מנשה ושרה, מאיר קלטר בן לייביש וצביה, ולול קלטר בן לייביש וצביה, סימה רוטן בת ולול וטוייבה שיינדל, דוב רוטן בן ולול וטוייבה שיינדל, גולדה דלמן בת שיינדל, סימה הילפר, ירחמיאל לושק בן אברהם ורוזה, לייביש לושק בן ירחמיאל וחיה מרים, חיה מרים לושק בת לייביש וציביה, ברנצ׳ה רוטן בת ולול וטוייבה שיינדל",
  },
  {
    fullname: "ליאת קמינסקי",
    id: uuidv4(),
    txt: "לעילוי נשמת חנן מטסרו בן הלנה",
  },
  {
    fullname: "עופר פרץ",
    id: uuidv4(),
    txt: "לעילוי נשמת יהודה בן שלביה",
  },
  {
    fullname: "שמואל בללי",
    id: uuidv4(),
    txt: "לעילוי נשמת יוסי גרשון בן אנה",
  },
  {
    fullname: "בת אל בכבוד",
    id: uuidv4(),
    txt: "לעילוי נשמת יוסי יוסף בן עדה",
  },
  {
    fullname: "שלומי ונעמה בללי",
    id: uuidv4(),
    txt: "לעילוי נשמת יוסף גרשון ז״ל",
  },
  {
    fullname: "משה ומאיה טווינה",
    id: uuidv4(),
    txt: "לעילוי נשמת יצחק בן הלה למשפחת טווינה",
  },
  {
    fullname: "לעילוי נשמת כדיה בת אברהם ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "תומר בוארון",
    id: uuidv4(),
    txt: "לעילוי נשמת לאה בוארון בת זהייה ז״ל",
  },
  {
    fullname: "רחלי אליהו",
    id: uuidv4(),
    txt: "לעילוי נשמת ליאור בן חיים צבי אליהו",
  },
  {
    fullname: "שלמה דומני",
    id: uuidv4(),
    txt: "לעילוי נשמת מור אבי יעקב בן שיפרא",
  },
  {
    fullname: "שרה דרורי",
    id: uuidv4(),
    txt: "לעילוי נשמת מנחם מנדל בן חיים שמואל ז״ל ולזכות שרה בת רבקה וסייעתא דשמיא לכל משפחת דרורי ובני ביתם בכל מכל כל",
  },
  {
    fullname: "אמיר חנצ׳נסקי",
    id: uuidv4(),
    txt: "לעילוי נשמת מנחם צבי בן חיים מרדכי. לבריאות, שמחה, הצלחה ובשורות טובות נעמה בת ציפורה ואמיר חיים בן מרים מלכה ומשפחותיהם",
  },
  {
    fullname: "חפציבה גלט",
    id: uuidv4(),
    txt: "לעילוי נשמת מרים בת חסיבה ואדוארד בן שמחה",
  },
  {
    fullname: "תומר מנור",
    id: uuidv4(),
    txt: "לעילוי נשמת משה כהן בן כמונה, שושנה כהן בת דג׳יריה ויעקב מרזוק בן עליזה. להצלחת שלומית חיון בן מיכל. להצלחת משה תומר מנור בן כרמלית. לרפואת מרסל מרזוק בת פורטונה. להצלחת מאיר מנור בן מרסל. להצלחת כרמלית מנור בת שושנה. להצלחת נועם מנור בן כרמלית. להצלחת עדן מנור בת כרמלית",
  },
  {
    fullname: "נאור טדרי",
    id: uuidv4(),
    txt: "לעילוי נשמת משה נחתומי ",
  },
  {
    fullname: "בתאל מזרחי",
    id: uuidv4(),
    txt: "לעילוי נשמת ניר עמיחי בן ארץ ",
  },
  {
    fullname: "אורנה ומשה מעוז",
    id: uuidv4(),
    txt: "לעילוי נשמת עדי מעוז ז״ל",
  },
  {
    fullname: "משה טוינה",
    id: uuidv4(),
    txt: "לעילוי נשמת עזיזה בת סלחה",
  },
    {
    fullname: "רחל זלמן",
    id: uuidv4(),
    txt: "לעילוי נשמת ציון סימנה בן רחל וציון מלכה בן אודט",
  },
  {
    fullname: "ליאור אלקיים",
    id: uuidv4(),
    txt: "לעילוי נשמת ציפורה בת מזל",
  },
  {
    fullname: "שלמה עזריאל",
    id: uuidv4(),
    txt: "לעילוי נשמת ר׳ יוסף בר מסעודה ז״ל נלב״ע ח׳ שבט תשנ״ט. חנה בת שמחה ז״ל נלב״ע י״א אב תש״פ. עליזה (מסעודה) בת חנה ז״ל נלב״ע י״ב כסלו תשפ״ב ת.נ.צ.ב.ה",
  },
  {
    fullname: "חגית בודן",
    id: uuidv4(),
    txt: "לעילוי נשמת רבקה בת מזל ויעקב ת.נ.צ.ב.ה",
  },
  {
    fullname: "אמנון ואסתר שינברגר",
    id: uuidv4(),
    txt: "לעילוי נשמת רועי שינברגר",
  },
  {
    fullname: "ברוך וזהורית צפירה",
    id: uuidv4(),
    txt: "לעילוי נשמת רות בת פרידה ותיאו (תיאודור) בן פרידה",
  },
  {
    fullname: "רונן הלל",
    id: uuidv4(),
    txt: "לעילוי נשמת שולמית הלל בת שלמה",
  },
  {
    fullname: "שמואל סלמון",
    id: uuidv4(),
    txt: "לעילוי נשמת שושנה בת יפה (נפטרה ב- כ״ט טבת תשע״ג)",
  },
  {
    fullname: "מזל סולימן",
    id: uuidv4(),
    txt: "לעילוי נשמת שושנה בת מזל ויום טוב וצבי בן נג׳י וסלימה",
  },
  {
    fullname: "טובי כהן",
    id: uuidv4(),
    txt: "לעילוי נשמת שירה בת רבקה שיינדל",
  },
  {
    fullname: "יעקב סרוסי",
    id: uuidv4(),
    txt: "לעילוי נשמת שלום בן מרים",
  },
  {
    fullname: "בני סניידר",
    id: uuidv4(),
    txt: "לעילוי נשמת שמואל בן דורה",
  },
  {
    fullname: "נחלה זילברמן",
    id: uuidv4(),
    txt: "לעילוי נשמת שמואל בן שרה",
  },
  {
    fullname: "שרון עוזיאל פלד",
    id: uuidv4(),
    txt: "לעילוי נשמת שמחה עוזיאל בת מזל מתילדה",
  },
  {
    fullname: "חיים קפלן",
    id: uuidv4(),
    txt: "לעילוי נשמת שמעון בן הירש לייב הלוי נלב״ע ט׳ ניסן תשע״ח. שלמה בן נחום הלוי נלב״ע ה׳ טבת תשע״ט. ת.נ.צ.ב.ה",
  },
  {
    fullname: "ירון סויסה",
    id: uuidv4(),
    txt: "לעילוי נשמת שרה בת דוד",
  },
  {
    fullname: "ארז ישרוף",
    id: uuidv4(),
    txt: "לעילוי נשמת שרה גו׳רג׳ט בת דוד",
  },
  {
    fullname: "קינן בר עוז",
    id: uuidv4(),
    txt: "לעילוי נשמת שרית בת ציפורה ומשה",
  },
  {
    fullname: "אסתר ונדרולד",
    id: uuidv4(),
    txt: "לעילוי נשמת אברהם גרשון בן יחזקאל ויעקב בן שמעון",
  },
  {
    fullname: "אביטל חדד",
    id: uuidv4(),
    txt: "לעילוי נשמת חנינה בת דיאמנטה, יוסף בן חנה, וורידה ורדה בת מרימה ויעקותא בת מרימה",
  },
  {
    fullname: "עירית ולנסי-מאוקונן",
    id: uuidv4(),
    txt: "לעילוי נשמת שרה בת אלישבע, יעקב (יאשה) בן לנה, לינדה בת אסתר, שלמה (אדמונד) בן באיה, ויקטוריה בת אסתר ויוסף בן שרה",
  },
  {
    fullname: "יעל בראון ארד וירון אושרי",
    id: uuidv4(),
    txt: "לעילוי נשמתם של הורי בנימין וזהבה אושרי ז״ל",
  },
  {
    fullname: "זלמן מנעולי קלמקה",
    id: uuidv4(),
    txt: "לעילוי נשמתם של מנחם מנדל וזיוה מנעולי קלמקה",
  },
  {
    fullname: "קרן וקנין",
    id: uuidv4(),
    txt: "לעילויי נשמת אימי מורתי גאולה בת לאה ז״ל ",
  },
  {
    fullname: "אייזלר ישראל ושירה",
    id: uuidv4(),
    txt: "לרפואה שלמה ובריאות איתנה לנורית בת סוליקא ולהצלחת הילדים היקרים יובל, זיו חיים ושליו חנה",
  },
  {
    fullname: "ליאת רפאל",
    id: uuidv4(),
    txt: "לרפואה שלמה ושפע ברכה והצלחה ליהודה בן בלור וורדה בת יטי",
  },
  {
    fullname: "יונה חממה צוביירי",
    id: uuidv4(),
    txt: "לרפואה שלמה ליונה חממה צוביירי בת ברוד",
  },
  {
    fullname: " יהב קריטי",
    id: uuidv4(),
    txt: "לרפואת שמחה בת עליזה, אהרון בן רחל ועופר בן שרה",
  },
  {
    fullname: "ברוריה בת אליס חיה ",
    id: uuidv4(),
    txt: "לרפואת בעלי ולרפואתי השלמה במהרה מיכאל מנחם בן חנה",
  },
  {
    fullname: "אסתי אבני",
    id: uuidv4(),
    txt: "לרפואת הדס בן דליה",
  },
  {
    fullname: "אורן צוברי",
    id: uuidv4(),
    txt: "לרפואת הוריי רפאל בן שרה ויונה בת אסתר",
  },
  {
    fullname: "שיראל רווח",
    id: uuidv4(),
    txt: "לרפואת הרב זאב חי בן גולדה הניה",
  },
  {
    fullname: "ראובן רבתי",
    id: uuidv4(),
    txt: "לרפואת והצלחת משפחת ראובן רבתי",
  },
  {
    fullname: "ליטל צבן",
    id: uuidv4(),
    txt: "לרפואת יוסף וציפורה בן ובת טיטה לרפואה שלמה במהרה בע״ה",
  },
  {
    fullname: "צורי זיגדון",
    id: uuidv4(),
    txt: "לרפואת יוסף זגדון בן גיטה ולרפואה והצלחה אופק בן מלי",
  },
  {
    fullname: "נדב גורמן",
    id: uuidv4(),
    txt: "לרפואת יצחק מאיר בן ברוך",
  },
  {
    fullname: "ניסים אבוטבול",
    id: uuidv4(),
    txt: "לרפואת לינדה בת סוזן, ענבר בת לינדה, שושנה בת חביבה ואביבה בת שושנה, רפואת הנפש ורפואת הגוף בכלל כל חולי עמו ישראל",
  },
  {
    fullname: "איתן שדה",
    id: uuidv4(),
    txt: "לרפואתו השלמה של שלמה בן יפה ולרפואת ורד בת אורנה בתוך שאר כל הזקוקים לישועה",
  },
  {
    fullname: "אכי״ר",
    id: uuidv4(),
    txt: "מוקדש לזכות קהילת חברים SG , לזכות כל אחד ואחת , החברים בקהילה וב״ב שיחיו לבריאות , שמחה , אושר ועושר , בגשמיות וברוחניות",
  },
  {
    fullname: "אברהם קאופמן",
    id: uuidv4(),
    txt: "מוקדש לעילוי נשמות יצחק ודינה קאופמן ז״ל",
  },
  {
    fullname: "חובב, נחמה ואהרון מנחם",
    id: uuidv4(),
    txt: "לזכות משפחת סוטחי, ברכה בגשמיות וברוחניות",
  },
  {
    fullname: "מירב חיים",
    id: uuidv4(),
    txt: "לעילוי נשמת נעומי בת מסודי ז״ל ויוסי בן נעומי ז״ל",
  },
  {
    fullname: "איציק ועדי עמר",
    id: uuidv4(),
    txt: "נתרם לרפואה שלמה ולהצלחת יצחק בן יפה, עדי בת פאולינה, הודיה אסתר בת עדי, אביגיל הדסה בת עדי ושרה אורה בת עדי",
  },
  {
    fullname: "סיון טוּבּא",
    id: uuidv4(),
    txt: "לזרע חיה וקיימא",
  },
  {
    fullname: "סמדר וג׳יי קופייצקי",
    id: uuidv4(),
    txt: "In Honor of Smadar and Jay Kupietzky",
  },
  {
    fullname: "דבורה אביגד",
    id: uuidv4(),
    txt: "עוז אברהם בן דבורה לזיווג. דבורה בת חממה יונה לבריאות הגוף והנפש. שמואל בן ציפורה לבריאות",
  },
  {
    fullname: "עזרא עובדיה עבוד",
    id: uuidv4(),
    txt: "לעילוי נשמת הוריי- עובדיה וחנה עבוד ז״ל. ולעילוי נשמת שרה יהודית, רחל ושמואל עבוד ז״ל, בני חנה ועובדיה עבוד ז״ל",
  },
  {
    fullname: "עינת (נתי) וישראל חרמ״ץ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רוית ואריה שטיין",
    id: uuidv4(),
    txt: "לעילוי נשמת שרה סאלי בת ליטמן ז״ל",
  },
  {
    fullname: "רונית ומשה יוסף הלטובסקי",
    id: uuidv4(),
    txt: "לעילוי נשמת אבי- גדעון בן יעקב הלטובסקי וכן לעילוי נשמת התינוקת טוהר בת ורד ושמואל (מולי) חיים אסא",
  },
  {
    fullname: "רן וקארן ראובן",
    id: uuidv4(),
    txt: "בברכת פרנסה ובריאות להם ולילדיהם",
  },
  {
    fullname: "נסים בן מזל",
    id: uuidv4(),
    txt: "רפואה שלימה לנסים בן מזל",
  },
  {
    fullname: "",
    id: uuidv4(),
    txt: "רפואה שלמה: שמעון בן פרידה, צביה בת חממה, אלי בן זוהרה, ג׳ולייט בת מרים, חנה בת ג׳ולייט ואבא בן עלושה לעילוי נשמת: חממה בת שמחה, זוהרה בת יחיה, שלמה בן סעיד, אברהם בן חווה, שמעון בן מסעודה, עלושה בת זקנה וזרח בן אסתר הצלחה וזיווג: רעות עליזה בת חנה לזיווג הגון. נהוראי מאיר וחן כהן להצלחה בחיים שמחה ושלום בית",
  },
  {
    fullname: "ד״ר דביר קוה",
    id: uuidv4(),
    txt: "לע״נ הסבים והסבתות דוד בן מרדכי וברכה, צפורה בת משה ולאה, מרדכי בן יהושע וריזל, זיסל בת משה ורבקה",
  },
  {
    fullname: "שיחי דשה וסמיון ציבקין",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עדנה וחיים פוקס",
    id: uuidv4(),
    txt: "לעילוי נשמת אמי מורתי פסיה בת יצחק-מאיר לבית מצנר ולעילוי נשמת אבי מורי אליהו בן קרול פוקס ולנשמות משפחותיהם שניספו בשואה",
  },
  {
    fullname: "שלמה יוסף ומרים מושקא זייאנץ",
    id: uuidv4(),
    txt: "Dedicated with Love by Shloime and Mushky Zionce",
  },
  {
    fullname: "אייל ארד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "514523117 ממאש הרשת ח.פ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אבי חלפון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אבי יוסף חי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אבי מהרט",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אבי קרקו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אבי רוזנווסר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אבי שאולזון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אביטל עוזרי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אבנר חיימוב",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אברהם בושרי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אברהם יהודה גרינולד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אברהם יצחק קלר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אברהם לייבוביץ׳",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אברהם לררלין",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אהרון משה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אודיה מוריה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אודליה לוריא",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אופיר ליאור",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אופק שרון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אורי אשר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אורי גבאי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אורי וינברגר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אוריאל קדמון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אורן אליה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אושרי אזולאי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אזולאי אבי ומרים",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "איילה סמוטריץ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אילנה בן שיטרית",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אילנית קויפמן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "איריס ג׳ורג׳י",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "איתמר שר שלום",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "איתן עיני",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלוילי שחר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלון ברקוביץ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלון ונק",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלון נפתלי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אליהו אשכנזי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלימלך דוד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלירן ומאיה אוחנה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלכס רצקובסקי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלמוג חוזה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אלקנה אסולין",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אמונה שלם",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אמיר דרטלר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אמיר היימן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אסף וורד דיין",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אסף ונונו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ארז אליס ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אריאל אוחיון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אריאלה אפלבאום",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אשר אביעד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אשר פז",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "בן ציון ולאה ליפסקר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "בנימין זאב וילהלם",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "בע״מ וילה פרסום",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "בע״מ טנא",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "בר-דוד ניסים",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "בראון שלמה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ברק כהן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "גבאי מוטי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "גבי ברוך",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "גבי יעיש",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "גדעון חברוני",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "גל גזית",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "גל שרה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דוב בער אורגד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דוב בעריש כהן הלפרין",
    id: uuidv4(),
    txt: "",
  },

  {
    fullname: "דוד יעקוביאן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דוד מוצפי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דוד שולמן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דוט נט בע״מ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דורית סוכר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דותן יעיש",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דיויד ורחל פריד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דיין אבשלום",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דינה פבזנר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דן גולדברגר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דניאל אוחיון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דניאל הלוי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דניאל יוגאי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דניאל קסלמן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "דניאלה חיה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "הוכבוים גיל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "הילה ונועם יאיר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "הילה מנדלברג",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "הירשהורן אלי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "הני פבזנר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "הרב גרשון יצחקי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "הרב עקיבא כץ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "הרץ אברהם",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "זיו אור",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "זעירא לירז",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "חב״ד צ׳אנג מאי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "חגית בן שאנן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "חגית הררי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "חוות יריחו בע״מ צחי בן עטיה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "חיה בן שמואל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "חיים בן חיים",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "חיים הראל ונעמה מרגלית",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "חליו שחר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "חן ושרה פרסיקו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "חנן אלקסלסי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "טובה מליחי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "טוני לוי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "אביטל וטל עזרא",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "טליה שלומי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יהודה בונפד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יהודית שטרן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יובל וחנה הלנה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוחאי טויטו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוחאי נתן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוני אזולאי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוסי בוחניק",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוסי חיים",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוסי מרטו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוסי שלום",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוסף אסף",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוסף זק״ש",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוסף מתנה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוסף נחמן סגל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יניב ורינת כרמי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יסמין יצחק פור",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יעל משעי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יעקב אלוני אל-רז ג׳נסיס בע״מ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יעקב נחמני",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יעקב שחר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ישי שרף",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ישראל קניג",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "כהן עזרא",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "כהן-פסריאן מרים",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "כפיר ואורית קצובר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "כפיר מליחי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "לורן ניסים- לורניס טורס",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ליאור ברקת",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ליאור קדוש",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ליזה אוזן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "לייה נאור",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ר׳ עוזר אלפרוביץ ומשפחת- לכיש טורס",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מאור אפרתי- האפרסמון בית תוכנה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מאיר גולדשטיין",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מאיר ושלי גינזבורג",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מאיר ליברטי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מאיר מיכאל שרביט",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מורד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מורן דגן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מיכאל לוי- יבוא ויצוא סובב עולם בע״מ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מיכל רווח",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מירב עוזרי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מנדי פישר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מני ווגובסקי",
    id: uuidv4(),
    txt: "",
  },

  {
    fullname: "מנס יעקב",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מעוז דביר-אבנר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מעיין ודוב ולצ׳ר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מעיין סעדון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מרדכי (מוטי) אוחיון ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מרים יצהרי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מרים מרדכי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מרכז הפעמון בע״מ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "משה בלייש",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "משה בן חמו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "משה ופזית",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "משה כאהן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "משפחת לוין",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "משפחת רימון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מתן קופר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נבו דובי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נדב אבי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נדב שטראלבר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נובה בטון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נועה ברכה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נועם באור",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נחמה דינה ווילהלם",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נחמיה ינון כהן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נידם משה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נילי פרדיאן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ניסן בן יהודה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נקר סתיו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נריה לייבוביץ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נתי ושני שמיע",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נתי לוי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נתן ציבין",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נתן שרעבי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נתנאל אברהם",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נתנאל כהן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "נתנאל מרציאנו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יוסי ועדינה גרינפלד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "יהונתן בן סימון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "סלין ומאוריס הרשקו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עדי איטח",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עדן דהן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עודד אלפסי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עודד בזרנו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עומרי גוטפלד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עופר וסמדר פרגר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עליזה כהן נאמן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "עמית בר מסדה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ענקי אמיר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ענת ומאור כהן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ערן קוזניצקי- שירותי ניהול בע״מ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "פיילויאל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "פלג מוסקוביץ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "פנינית דיקשטיין",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "פנינת ינאי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "פתחיה וינשטיין",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "צבי נעים",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "צבי פלורנטל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "צבייה איבס",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "צביקה ליפסקר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "צוברי משה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "צור אליאב",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "צחי וספיר בלה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ציפי מנהיימר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "ק״ק אירקוטסק רוסיה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "קליין מנחם",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "קרולין ופטריק לנדאו",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "קרמר מיכל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "קרן אופיר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רבקה וחיים לביוב",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רבקה סימון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רוימי דותן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רונן אברגל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רונן ונירית פלד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רועי טופז",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רחל ידיד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רחמים שרעבי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רייניץ יוסי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רן עובד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רפי וטליה אטיאס",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "רפפורט נועם",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שי אילנד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שי אסף",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שי טופז",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שייקה שטייגל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שילון פיתוח ויזמות בע״מ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שלום ברוכים",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שלום גולדשמיד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שלמה אפלר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שמואל מקובצקי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שמחה הקטר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שמעון סיבוני",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שמרית ידסי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שניאור סגל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שניאור שטיינברג",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שרה גל",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שרה מיארה",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שרון בן שושן",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שרון דרור",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שרון ליבר",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "שרית חדד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "תהילה אורבי",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "מאיר אוחנון",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Henry Wyman",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "בת חן חדד",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Adina Stone",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Avraham Davidshvili",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Burt Samuelson",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Chaim Drizin",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Chaim Lipszyc",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Dornbusch",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Eddie Yair",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Eliyahu Gorgov",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Jacob Kadosh",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Joel Fhima",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Joseph Slater",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Joshua & Vera Guttman TZ",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Karen Pichel",
    id: uuidv4(),
    txt: "In memory of my paternal great grandmother Clara Lassoff. May her memory be blessed. In memory of my maternal grandmother Esther Dennis. May her memory be blessed. In memory of my paternal grandmother Blanche Lassoff Pichel, Blanche ben Menachem Mendel. May her memory be blessed",
  },
  {
    fullname: "Kevin C Lefco",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Ori Oron",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Rahamim Dabush",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Ronny Rozental",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Ruben Rotenberg",
    id: uuidv4(),
    txt: "",
  },
  {
    fullname: "Shmuel Lipszyc",
    id: uuidv4(),
    txt: "",
  },
];
