import { v4 as uuidv4 } from "uuid";
export const donatoesService = {
  query,
};

function query(filterBy) {
  let donators = gDonators;
  if (filterBy) {
    donators = gDonators.filter(
      (donator) =>
        donator.txt2.toLowerCase().includes(filterBy) ||
        donator.txt2.toUpperCase().includes(filterBy) ||
        donator.txt1.includes(filterBy)
    );
  }
  return [...donators];
}

const gDonators = [
  {
    txt2: "הוקדש על ידי עודד אלפסי",
    id: uuidv4(),
    txt1: "לע״נ ברוך לוי בן ג׳ורגיה",
  },
  {
    txt2: "לזכות שראל גבאי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לעילוי נשמת אושר בן חנן וחנה נחמני, נפטר כ״א בניסן שביעי של פסח תשע״א",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אבי ואורה קפלן",
    id: uuidv4(),
    txt1: "לזכר הורינו ר׳ יצחק דוד קפלן ואשתו ברכה לבית זמורה ורבי שמואל אברהם סלומון ואשתו גוסטל לבית הויזמן",
  },
  {
    txt2: "לזכות יחזקאל היימן יהושע",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות צבי איל גולדשטיין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלונה בת מירה לזיווג הגון ובנין עדי עד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אלחנן זוננפלד",
    id: uuidv4(),
    txt1: "לע״נ אמי רחל בת אלחנן זאב ז״ל",
  },
  {
    txt2: "אלינור ויהונתן בן סימון",
    id: uuidv4(),
    txt1: "לזכות בניה בן אלינור וללידה קלה כתרנגולת",
  },
  {
    txt2: "הוקדש על ידי אמנון אהרונוב",
    id: uuidv4(),
    txt1: 'לזכות הורי ז"ל- מור אבי בוריס הן הרב דוד הכהן ומאת אימי מזל בת שושנה',
  },
  {
    txt2: "הוקדש על ידי אשרת ואופיר כהן",
    id: uuidv4(),
    txt1: "לרפואה ואריכות ימים ולסגולה בת מזל",
  },
  {
    txt2: "אורה שמחה בת תראכי בריאות אריכות ימים ושנים מתוך בריאות ושובע שמחות ויקויים בי דור ישרים יבורך",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי שי לביא",
    id: uuidv4(),
    txt1: "בעזרת השם לאחדות כל ישראל",
  },
  {
    txt2: "הוקדש על ידי יואבה שלמה",
    id: uuidv4(),
    txt1: "לעילוי נשמת הוריי סעידה מזל בת הרב אברהם וישראל בן רבי חיים, לחזרה בתשובה וזרע של קיימה לילדיי רעות ונריה",
  },
  {
    txt2: "לזכותו ולבריאותו של דורון פינקלשטיין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי דליה ואלכסנדר יעקב אייזנשטדט",
    id: uuidv4(),
    txt1: "לעילוי נשמת בתיה בת רחל ואפרים בן רחל",
  },
  {
    txt2: "הוקדש על ידי מזל נפשי",
    id: uuidv4(),
    txt1: "לרפואת הגוף והנפש לאמיר בן מזל ולהבדיל, לעילוי נשמת יצחק חיים בן מירב ויחזקאל",
  },
  {
    txt2: "הוקדש על ידי ורדית ונתנאל מזרחי",
    id: uuidv4(),
    txt1: "לרפואת והצלחת הלל אסתר בת ורדית",
  },
  {
    txt2: "חנוך ומורן כהן",
    id: uuidv4(),
    txt1: "לזרע בר קיימא",
  },
  {
    txt2: "הוקדש על ידי צפנת שלום",
    id: uuidv4(),
    txt1: "טליה בת צפנת לבריאות והצלחה בלימודים ובכל",
  },
  {
    txt2: "הוקדש על ידי יוסף ברוכים",
    id: uuidv4(),
    txt1: "יהודית בת שולמית לכל הישעות",
  },
  {
    txt2: "הוקדש על ידי יובל אטיאס",
    id: uuidv4(),
    txt1: "לזכות יובל בן אסתר, הילה בת מזל, יעל מזל בת הילה, אפרת אסתר בת הילה, יאיר הן הילה, אליה בן הילה למשפחת אטיאס",
  },
  {
    txt2: "הוקדש על ידי יעקב ובת שבע בנימין",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבי בנימין בן חנה",
  },
  {
    txt2: "הוקדש על ידי יצחק (איצ'ה) כהן",
    id: uuidv4(),
    txt1: "לעילוי נשמת רעייתי נורית כהן ז״ל שנפטרה בטרם עת ושנזכה לבשורות טובות אמן",
  },
  {
    txt2: " הוקדש על ידי יונתן אזרזר",
    id: uuidv4(),
    txt1: " לעילוי נשמת יצחק אזרזר בן חביבה",
  },
  {
    txt2: " לזכות יצחק אלדר בן שרה הגר לבית בנבט",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אברהם בן חמו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אודי ודורית אליהו",
    id: uuidv4(),
    txt1: "לבריאות ושלומם של חיילי צה״ל וכל עם ישראל",
  },
  {
    txt2: "לברכה והצלחה של עמנואל ואריאלה לוי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי זוהרה קלמן לוי",
    id: uuidv4(),
    txt1: "להוריי נתן לוי לוחם חירות ישראל בירושלים ורבקה לוי",
  },
  {
    txt2: "להצלחה בגשמיות ובפרט ברוחניות למשפחת חיים ואורה לדיוב",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי עמי שרביט",
    id: uuidv4(),
    txt1: "להצלחה בכל העניינים ליחיעם בן דינה, לעילוי אהרון בר שמחה, רחל בר מסעודה, רבי יחיא בר אסתר, ימנה פרחה ולרפואת אמי רחל בת רותי",
  },
  {
    txt2: "להצלחה, בריאות, שלום בית, חינוך ילדים ופרנסה טובה, כל הישועות למשפחת נקש",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "להצלחת ידגראן רוברט ומשפחתו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "להצלחת ארז והדר צפרי וכל משפחתם בכל העניינים ולע״נ ציון חסן בן ליזה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לעילוי נשמת המנוח חיים נגר בן ברכה ואברהם ז״ל ת.נ.צ.ב.ה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לעילוי נשמת מזל בת מרים ושלמה בן יוסף ת.נ.צ.ב.ה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "להצלחת דוד אברהם יצחק בן בת שבע רות וב״ב בכל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "להצלחת מיטל מזל בת יפה בכל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "להצלחת מיקי מקיקס בן שושנה עזרא וב״ב",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "להצלחת מיכאל בן דדה ומשפחתו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "להצלחת משפחת בכר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי מנחם הרטמן",
    id: uuidv4(),
    txt1: "להצלחת משפחת וילהלם שיחי",
  },
  {
    txt2: "הוקדש על ידי איציק ימין",
    id: uuidv4(),
    txt1: "להצלחת משפחת ימין ולעילוי נשמת אליהו בן נעימה",
  },
  {
    txt2: "להצלחת משפחת עדנה בת דייזי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "להצלחת ניר נתן בן שמאי ובני ביתו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אלון ונק",
    id: uuidv4(),
    txt1: "להצלחת עם ישראל",
  },
  {
    txt2: "הוקדש על ידי אבי אברהם",
    id: uuidv4(),
    txt1: "להצלחת עם ישראל וחיילי צה״ל",
  },
  {
    txt2: "הוקדש על ידי דב ומירב שאול",
    id: uuidv4(),
    txt1: "לעילוי נשמת יצחק חיים בן מירב",
  },
  {
    txt2: "הוקדש על ידי יואל רדעי",
    id: uuidv4(),
    txt1: "לזיווג מהיר למיכל בת יואל רדעי ולחן בת אופירה סולמי",
  },
  {
    txt2: "הוקדש על ידי נעמי קירש",
    id: uuidv4(),
    txt1: "לזיווג משורש הנשמה במהרה ממש ובבריאות לבתנו שרה בת נעמי ומרדכי. לעילוי נשמת הורי: חיים בן יעקב ומניה-חיה מלכה בת דב-בעריש",
  },
  {
    txt2: "לזכות מאיר ניסים וצליל כהן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חנניה שולטי שיחי׳",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות גילה בת לאה, חדרך בן יוכבד ז״ל, שקד בן גילה, שגיא בן גילה, רועי בן גילה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אבבה מהרט",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות איתמר ונטע אברקי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלון ונדיה בן מרדכי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלי ועליה שקרצי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אליעזר אריה קורנפלד",
    id: uuidv4(),
    txt1: "לזכות אליעזר אריה בן רות ולזכות אמי רות בת חנה",
  },
  {
    txt2: "לזכות אסתר רפיעי בת שרה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אתי כהן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי ליאת שגיב היקרי",
    id: uuidv4(),
    txt1: "לזכות בנותיי היקרות טליה, נטי ואדר בנות ליאת. לזיווג הגון משורש נשמתן והקמת בית נאמן בישראל, בניין עדי עד ולזכות עם ישראל כולו",
  },
  {
    txt2: "הוקדש על ידי חיה נדב",
    id: uuidv4(),
    txt1: "לזכות בעלי אילן בן מזל",
  },
  {
    txt2: "לזכות ברוכים יחיאל ורחל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות גלעד בן דרורה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דוד מרדכי טויטו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי מאור חי הלוי",
    id: uuidv4(),
    txt1: "לזכות דניאל בן רינה",
  },
  {
    txt2: "הוקדש על ידי שילת דנינו",
    id: uuidv4(),
    txt1: "לזכות דנית בת רות ורועי בן רונית- לפרי בטן",
  },
  {
    txt2: "לזכות דפנה ושלמה צלליכין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי לירן שרעבי",
    id: uuidv4(),
    txt1: "לזכות ההורים שלי, דניאל ואריאלה שרעבי",
  },
  {
    txt2: "הוקדש על ידי אהוד שרעבי",
    id: uuidv4(),
    txt1: "לזכות הוריי היקרים רוני בן רהב ומרים בת אבוסעוד, שאלוהים ישמרם וישלח להם בריאות איתנה",
  },
  {
    txt2: "לזכות הרצל וכוכבה מגן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי יוכבד צפורה ואיתמר פריימרק",
    id: uuidv4(),
    txt1: "לזכות ולהצלחת בננו אוריה ואליאב בן יוכבד צפורה ואיתמר",
  },
  {
    txt2: "לזכות חגית בוני-נח",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חן בן טובה מליחי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי יהונתן גוטמן",
    id: uuidv4(),
    txt1: "לזכות חנה בת רחל יוכבד",
  },
  {
    txt2: "לזכות יגאל יוסף ולכל משפחתו להצלחה ולבריאות",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יואב בן טובה שמאי, לזיווג עם אישה יראת ה במהרה ולהקמת בית עם טהרה קדושה שלום בית ושמחה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יואל דיל ומשפחתו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוכי ומאיר צחור ובני ביתם מבית גמליאל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יחיאל בן יששכר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יפתח בן נצחיה ויאיר צורף",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מאיה וחגי בן אברהם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי יהודה בן חור",
    id: uuidv4(),
    txt1: "לזכות מורן בת שושנה להיריון תקין ולידה קלה ולזכות הילדים שירה בת מורן, שילת בת מורן, יוסף יצחק בן מורן. נחת חסידי מהם",
  },
  {
    txt2: "הוקדש על ידי מורן בן גיאת",
    id: uuidv4(),
    txt1: "לזכות מורן מרלין בת פורטונה לבנה, ולעילוי נשמת סבי וסבתי אברהם אלברט בן זהרה מרייט מרלין בת פורטונה",
  },
  {
    txt2: "לזכות מיכאל פינטו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: " לזכות מיקי ואלברט בראל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מרדכי וקנין ורוזה גמזו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אברהם קליין",
    id: uuidv4(),
    txt1: "לזכות משפחות קליין, וינטר והירשקורן, לבריאות ואריכות ימים, נחת והצלחה בכל",
  },
  {
    txt2: "לזכות משפחת אוהב עמי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משפחת ארביב, בת שבע בת דינה ומתן בן יהודית, וילדיהם לביא יוסף בן בת שבע ואריאל בן בת שבע",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משפחת וילנר: רוני ניר מלי תמר מטילדה יהונתן יוסף איתי יהודה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משפחת טהר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משפחת טרייגר, מקסיקו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משפחת ירדן, ירושלים",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אושריה סלע",
    id: uuidv4(),
    txt1: "לזכות משפחת סלע, לעילוי נשמת אבי- אריה בן רות ודוד ולעילוי נשמת יורם בן זהרה וישראל",
  },
  {
    txt2: "לזכות משפחת פלפלי והצלחתם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משפחת קדוש, לונדון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אמיר קולברג",
    id: uuidv4(),
    txt1: "לזכות משפחת קולברג ולעילוי נשמת בינה שולמית קולברג",
  },
  {
    txt2: "לזכות משפחת רופא חיים",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משפחת שטראוס, מודיעין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נאוה ועדו אורלוב",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נטלי ואמיר חורב",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ניר קבלו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עדי קארן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי משה שלמה",
    id: uuidv4(),
    txt1: "לזכות עדי שלמה בת יפה ולעילוי נשמת מוריס בן מרימה",
  },
  {
    txt2: "הוקדש על ידי סיגל בוכריס",
    id: uuidv4(),
    txt1: "לזכות עדן שני ונתנאל בוכריס",
  },
  {
    txt2: "לזכות עודד ואוראל אליאס",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עמנואל דמתי ומשפחתו, בריאות והצלחה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עמנואל ונאוה סלם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עמרם פינטו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות פטריסיה וטל יהודה מדיוני",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות צדוק יחזקאל בן כתון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות צחי וכינרת דקל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רויטל בת חדוה לכל הישועות",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רוני ולילך שניידר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שי ומימי יעקובוב",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שלומי בן צביה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שלמה חיים וחנה ברונשטיין ומשפחתם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שרי ואיציק בר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אילן כץ",
    id: uuidv4(),
    txt1: "לזכר אבי המנוח שלום בן רבי שמואל הכהן כ״ץ",
  },
  {
    txt2: "הוקדש על ידי איתן בר און",
    id: uuidv4(),
    txt1: "לזכר אשר דויטש ז״ל",
  },
  {
    txt2: "הוקדש על ידי אסתר ביטון",
    id: uuidv4(),
    txt1: "לזכרו של בני שנפל במבצע צוק איתן- מימון מידן ביטון",
  },
  {
    txt2: "הוקדש על ידי אברהם דוד עמר",
    id: uuidv4(),
    txt1: "לזכרו של יוסי בן מרים ז״ל",
  },
  {
    txt2: "הוקדש על ידי איתמר שר שלום",
    id: uuidv4(),
    txt1: "לעילוי נשמת נח ציון שר שלום הכהן בן רחמים ואסתר שר שלום נפטר ביום כג חשון תשפ״א",
  },
  {
    txt2: "הוקדש על ידי שלומית ויאיר עפג׳ין",
    id: uuidv4(),
    txt1: "לע״נ נזיהא בת ריחנה גואטה נלב״ע כ״ו מנחם אב תשע״ח, אביגדור ויטו חואטו בן נזיהא גואטה נלב״ע ט״ו תשרי תשע״ט, רומיה עפג׳ין בת אברהם ז״ל נפטרה ג׳ תשרי התשע״ד, יששכר עפג׳ין  בן יחיא ז״ל נפטר כג׳ שבט התש״ע",
  },
  {
    txt2: "הוקדש על ידי אפרת ובנימין זרביב",
    id: uuidv4(),
    txt1: "לכבוד הגאולה האמתית והשלימה תיכף ומיד ממש!",
  },
  {
    txt2: "הוקדש על ידי דניאל זנג",
    id: uuidv4(),
    txt1: "לע״נ אפרים דוד בן ג׳רלד זנג",
  },
  {
    txt2: "הוקדש על ידי יענקלה קרוגליאק",
    id: uuidv4(),
    txt1: "לע״נ בנינו היקר אריק (אהרן מרדכי) הי״ד אשר נרצח ב כ״ד אדר תשס״ב מידי מחבל ערבי, עת שלמד בישיבה-מכינה קדם צבאית בעצמונה",
  },
  {
    txt2: "הוקדש על ידי אילה יעקובי",
    id: uuidv4(),
    txt1: "לע״נ הורי שמואל וחנה יעקובי, אחי יוסף יעקובי, ואחיותי שושנה בר מוחא ואביבה פדידה. ברכה והצלחה לביתי חנה ובעלה מאור יצחק חיון והילדים עתי אברהם ואלה אנט",
  },
  {
    txt2: "הוקדש על ידי ילדיהם יבלחט״א ר׳ שמחה ישראל הכהן ויהודית דבורה כהן ומשפחתם יצ״ו",
    id: uuidv4(),
    txt1: "לע״נ הר״ר בנימין הכהן בן ר׳ יהודה יוסף הכהן זצ״ל כ״ץ ",
  },
  {
    txt2: "הוקדש על ידי יוסף מאיר איגל",
    id: uuidv4(),
    txt1: "לע״נ הרה״ח אליעזר בהרה״ח אברהם יעקב (מוזס), לע״נ הרה״ח אברהם דוב בהרה״ח נפתלי חיים (איגל), לזכות הרב יוסף חיים קאנטור ומשפחתו, לזכות הרב נחמיה וילהלם ומשפחתו",
  },
  {
    txt2: "הוקדש על ידי בני ותהילה מרקוביץ",
    id: uuidv4(),
    txt1: "לע״נ חיה ליבא בת יצחק",
  },
  {
    txt2: "הוקדש על ידי מאור זמיר",
    id: uuidv4(),
    txt1: "לע״נ חיים זוסמן, לע״נ ניסים לומברוזו, לע״נ מזל טוב לומברוזו",
  },
  {
    txt2: "הוקדש על ידי רועי ונטע מרילי",
    id: uuidv4(),
    txt1: "לע״נ חסידה בת רינה ז״ל ",
  },
  {
    txt2: "הוקדש על ידי שחר נידאם",
    id: uuidv4(),
    txt1: "לע״נ לטיפה מגידנה ז״ל בת רזול וסאלח הלויים ע״ה",
  },
  {
    txt2: "הוקדש על ידי יניב שלום",
    id: uuidv4(),
    txt1: "לע״נ מלכה בת הנרי אהרן ורחל",
  },
  {
    txt2: "הוקדש על ידי רחל וולף",
    id: uuidv4(),
    txt1: "לעילוי נישמת אבי ז״ל עזרא בן רחל",
  },
  {
    txt2: "לזכות חיים שניידר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי יהודית ואלי פדידה",
    id: uuidv4(),
    txt1: "לעילוי נישמת אבי עזיז בן לילה ואימי מחרוסה בת פרחה (אמא שנפטרה בהיותי בת 3) ואימי דינה בת בת שבע (האמא שגידלה אותי)",
  },
  {
    txt2: "הוקדש על ידי גואל דוידיאן",
    id: uuidv4(),
    txt1: "לעילוי נשמת עזריה בן מרים ושרה בת גוהאר",
  },
  {
    txt2: " הוקד על ידי אלון פרץ",
    id: uuidv4(),
    txt1: "לעילוי נשמתה של שלומית פרץ שבחייה אהבה את העשייה של הרב נחמיה וכל העוסקים במלאכה המבורכת",
  },
  {
    txt2: "הוקדש על ידי דרור ותארי",
    id: uuidv4(),
    txt1: "לעילוי נשמות טהורות יוסף ותארי ושלמה ענקי",
  },
  {
    txt2: "הוקדש על ידי ליאורה ואייל חן",
    id: uuidv4(),
    txt1: "לעילוי נשמות יוסף חן, בלומה וחיים שני",
  },
  {
    txt2: "הוקדש על ידי עובדיה לוי",
    id: uuidv4(),
    txt1: "לעילוי נשמותיהם של מקסים ניסים לוי בן מסעודה, שמואל כהן בן עזיזה, רחמה כהן בת עיישה. לבריאותם הצלחתם וברכתם של כל משפחות לוי וכהן",
  },
  {
    txt2: "הוקדש על ידי אפרת שטרהל",
    id: uuidv4(),
    txt1: "לעילוי נשמת לוחם ימ״מ נעם בן ישעיהו רז הי״ד שנהרג על קידוש ה׳ ושמירת עמנו",
  },
  {
    txt2: "הוקדש על ידי יחיאל ונעמי רחמים",
    id: uuidv4(),
    txt1: "לעילוי נשמת משה מרדכי הכהן בן יצחק ברכה בת לאה עדנה בת ברכה",
  },
  {
    txt2: "הוקדש על ידי שלמה גבאי",
    id: uuidv4(),
    txt1: "לעילוי נשמת אברהם אלברט בן שלמה",
  },
  {
    txt2: "הוקדש על ידי ראודור ומזל מנור",
    id: uuidv4(),
    txt1: "לעילוי נשמת  אינס וגבריאל אמירא ז״ל, רחל מנור ז״ל, אבי גבאי ז״ל",
  },
  {
    txt2: "הוקדש על ידי חן גיספאן",
    id: uuidv4(),
    txt1: "לעילוי נשמת חבצלת בת שרה צפריר בן ברוריה. לזיווג הגון- חן בת חבצלת בתוך שאר רווקי ורווקות עם ישראל",
  },
  {
    txt2: "הוקדש על ידי רני רבין",
    id: uuidv4(),
    txt1: "לעילוי נשמת רוזי רוזט שושנה בת פרידה ע״ה למשפחת רבין",
  },
  {
    txt2: "הוקדש על ידי שלמה וסבינה לוי",
    id: uuidv4(),
    txt1: "לעילוי נשמת מתילדה בת רחל ואריה בן מתילדה",
  },
  {
    txt2: "לעילוי נשמת- יואל רחמים בן רחל, לזכות הילדים שיחיו החיילים בצבאות ה׳- נעמי, יעל, הדסה, מנחם מענדל ויוסף יצחק ההורים אלעד ונטע קורן ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אשר פרץ",
    id: uuidv4(),
    txt1: "לעילוי נשמת  אליהו מורסיאנו בן פרחה ואברהם ועליזה שריד בת עמם",
  },
  {
    txt2: "הוקדש על ידי עובדיה חממה",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבי ז״ל מאיר חממה בן שמחה ויחזקאל",
  },
  {
    txt2: "הוקדש על ידי אברהם בן חמו",
    id: uuidv4(),
    txt1: "לעילוי נשמת חיים בר רחל, איזה בת שמחה, יעקב בר יקוט, מרים בת עיישה ויצחק בר איזה",
  },
  {
    txt2: "הוקדש על ידי מזל שרים",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבא שלי רבי מתתיהו עזרא בן מזל ,אב בית הדין ירושלים",
  },
  {
    txt2: "הוקדש על ידי צדוק ויעל נקש",
    id: uuidv4(),
    txt1: "להצלחת עם ישראל",
  },
  {
    txt2: "הוקדש על ידי אבי קדושים",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבי אליהו בן אברהם קדושים , ואימי , אהטרם בת קשוור קדושים",
  },
  {
    txt2: "הוקדש על ידי גבריאל גרין",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבי גורדון גרין",
  },
  {
    txt2: "הוקדש על ידי יעקב כהן",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבי יאיר בן מרים וחמי חיים אליהו בן  אהובה",
  },
  {
    txt2: "הוקדש על ידי גילה פרץ",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבי מורי בנימין בן רג׳ילה. ולאריכות ימים בשובע לאימי מורתי טיטה בת רחימה",
  },
  {
    txt2: "הוקדש על ידי יהודה הלפרין",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבי מורי הרב רפאל בן חיים יעקב זצ״ל ואימי מורתי ברטינה סימונה בת חנוך ע״ה הלפרין ",
  },
  {
    txt2: "הוקדש על ידי יואל פוקס",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבי מורי הרב שמואל בן אהרן. ולעילוי נשמת אימי מורתי דבורה בת זאב ",
  },
  {
    txt2: "הוקדש על ידי חיה בן עמי",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבי ראובן בן חתון ולזכות אימי שתחי׳ סבריה בת צ׳אחלה לזכות חיה בת סבריה",
  },
  {
    txt2: "הוקדש על ידי עזריאל מדעי",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבי שלמה בן דוד מדעי, לעילוי נשמת אסף טספהון בן נגיסטה ",
  },
  {
    txt2: "הוקדש על ידי עדינה גרינפלד",
    id: uuidv4(),
    txt1: "לעילוי נשמת אברהם בן ציפורה ודב גרינפלד",
  },
  {
    txt2: " הוקדש על ידי אריאל ירון",
    id: uuidv4(),
    txt1: "לעילוי נשמת אברהם בן שרה",
  },
  {
    txt2: "הוקדש על ידי שלמה והבה",
    id: uuidv4(),
    txt1: "לעילוי נשמת אברהם ברומה בן נזלי רומנו, וורדה בת פורטונה והבה, בריאות לכל עם ישראל",
  },
  {
    txt2: "הוקדש על ידי מקס חמו",
    id: uuidv4(),
    txt1: "לעילוי נשמת אדיב אליהו בן חסנה, משה חמו בין עישה, חסיבה חמו בת מסעודה.  זיווג למשה מאור ועדיאל חמו בני מרגלית. זיווג לאדם סאידוב בן יפית. ברכה והצלחה ליפית ומקסו חמו. ולהילל יצחק בן שרה",
  },
  {
    txt2: "הוקדש על ידי אסף הוכמן",
    id: uuidv4(),
    txt1: "לעילוי נשמת אהרון ושרה הוכמן",
  },
  {
    txt2: "הוקדש על ידי רעות אסולין",
    id: uuidv4(),
    txt1: "לעילוי נשמת אודליה בת שבע בת שמואל ומרים",
  },
  {
    txt2: "הוקדש על ידי אבנר נחשון",
    id: uuidv4(),
    txt1: "לעילוי נשמת אחי דוד בן יונה נחשון ",
  },
  {
    txt2: "הוקדש על ידי משה נאור",
    id: uuidv4(),
    txt1: "לעילוי נשמת אימי ז״ל ברכה בת מרים",
  },
  {
    txt2: "הוקדש על ידי רות אליעזר",
    id: uuidv4(),
    txt1: "לעילוי נשמת אימי מורתי מרוסה דבורה בת שרבת",
  },
  {
    txt2: "הוקדש על ידי שרה מיארה",
    id: uuidv4(),
    txt1: "לעילוי נשמת אליהו בן איזה",
  },
  {
    txt2: "הוקדש על ידי זהבית קהת",
    id: uuidv4(),
    txt1: "לעילוי נשמת אמא שלי חנה בת לאה",
  },
  {
    txt2: "הוקדש על ידי תמיר שפר",
    id: uuidv4(),
    txt1: "לעילוי נשמת אמי מורתי ראומה פרידה בת יעקב ולהבדיל לזכות אשתי איריס בת שרה ולזכות בניי עידן בן שרון, ברק בן שרון ,כפיר בן שרון, דולב בן שרון",
  },
  {
    txt2: "הוקדש על ידי דוד ורות לינוי",
    id: uuidv4(),
    txt1: "לעילוי נשמת אמיתי בן יוכבד",
  },
  {
    txt2: "הוקדש על ידי לירז גל",
    id: uuidv4(),
    txt1: "לעילוי נשמת אסתר בת מרים, סבתי היקרה ז״ל",
  },
  {
    txt2: "הוקדש על ידי סיני פסל",
    id: uuidv4(),
    txt1: "לעילוי נשמת אסתר ויצחק פסל ",
  },
  {
    txt2: "הוקדש על ידי לינוי גולני",
    id: uuidv4(),
    txt1: "לעילוי נשמת אפרים בן ידידה ויחיא",
  },
  {
    txt2: "הוקדש על ידי יעקב דהאן",
    id: uuidv4(),
    txt1: "לעילוי נשמת בנימין דהאן בן עישה, אביתר מאיר בן רחל, רחל בת קלרה",
  },
  {
    txt2: "הוקדש על ידי יהודה ושרי כרייף",
    id: uuidv4(),
    txt1: "לעילוי נשמת בנימין יונה בן זוריה ז״ל",
  },
  {
    txt2: "הוקדש על ידי מיכל הראל",
    id: uuidv4(),
    txt1: "לעילוי נשמת ברוך בן ורדה, סיסיליה בת שרה, כתון בת ורדה. ולבריאות וחיים טובים וארוכים לרגינה בת חיסנה",
  },
  {
    txt2: "הוקדש על ידי משה פריגן",
    id: uuidv4(),
    txt1: "לעילוי נשמת בתיה ושאול פריגן, יסוד המעלה",
  },
  {
    txt2: "הוקדש על ידי סימה אופיר מור",
    id: uuidv4(),
    txt1: "לעילוי נשמת גבריאל בן שרה בוטראשוילי",
  },
  {
    txt2: "הוקדש על ידי לאה ספסקי",
    id: uuidv4(),
    txt1: "לעילוי נשמת דבורה ברכה בת חנה",
  },
  {
    txt2: "תקרומת דורית ויהודה בינדר",
    id: uuidv4(),
    txt1: "לעילוי נשמת דוד בן רוחמה, לעילוי נשמת מיכאל יוסף בן יהודה",
  },
  {
    txt2: "הוקדש על ידי אבנר וקנין",
    id: uuidv4(),
    txt1: "לעילוי נשמת דליה בת עליזה וקנין",
  },
  {
    txt2: "הוקדש על ידי שני רוזנבלום",
    id: uuidv4(),
    txt1: "לעילוי נשמת דניאל בן שני",
  },
  {
    txt2: "הוקדש על ידי מזל פורטונה קשי",
    id: uuidv4(),
    txt1: "לעילוי נשמת הוריי משה בן מסעודה ודינה בת שמחה. שמשון בן רוזה, יפה בת דינה, רינה אראלה בת דינה, יהודה בן דינה, דוד בן דינה",
  },
  {
    txt2: "הוקדש על ידי אורלי כהן פלדמן",
    id: uuidv4(),
    txt1: "לעילוי נשמת הוריי טוני בת מזל ומסעוד אשר וארטיגס מאוריציו משה בן רוזה רעיה ושלמה סולומון",
  },
  {
    txt2: "הוקדש על ידי מירה קדוש",
    id: uuidv4(),
    txt1: "לעילוי נשמת הורי היקרים עליזה בת חנה ושמעון בן תמו",
  },
  {
    txt2: "הוקדש על ידי הרצל אביב",
    id: uuidv4(),
    txt1: "לעילוי נשמת הוריי דניאל משלה בן מוריג'אן ולאה טאוס בת מונואר",
  },
  {
    txt2: "הוקדש על ידי יעל עמוס",
    id: uuidv4(),
    txt1: "לעילוי נשמת הוריי יוסף וזהרה עמוס ולעילוי נשמת רינה בת מזל",
  },
  {
    txt2: "הוקדש על ידי אברהם קבסה",
    id: uuidv4(),
    txt1: "לעילוי נשמת הוריי זיכרונם לברכה ,שמעון ואסתר קבסה ",
  },
  {
    txt2: "הוקדש על ידי מוטי זינו",
    id: uuidv4(),
    txt1: "לעילוי נשמת הוריי יהודה וסימי זינו ז״ל",
  },
  {
    txt2: "הוקדש על ידי יהושע חיות",
    id: uuidv4(),
    txt1: "לעילוי נשמת הורינו ז״ל עטי זיסל בת אברהם דב, משה לייב בן אברהם, מרגלית בת יול ושמעון בן יהושע צבי",
  },
  {
    txt2: "הוקדש על ידי רבקה גולדשלגר",
    id: uuidv4(),
    txt1: "לעילוי נשמת החסיד אשר בן שלמה זלמן ע״ה",
  },
  {
    txt2: "לעילוי נשמת הנערה חיה חנה קריאם ז״ל בת גאולה ואלי הי״ו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אביעד שחר",
    id: uuidv4(),
    txt1: "לעילוי נשמת הסבתות שלנו- רחמה בת עישה ורבקה חיה בת מלכה",
  },
  {
    txt2: "הוקדש על ידי יאיר אדרי",
    id: uuidv4(),
    txt1: "לעילוי נשמת הרב אליקים אלוני בן פנינה תרנג׳ה ולעילוי נשמת רבי יעיש אדרי בן אסתר",
  },
  {
    txt2: "הוקדש על ידי שמחה אברהם אשלג",
    id: uuidv4(),
    txt1: "לעילוי נשמת הרבנית יודית חיה חנה בת הרב יצחק שמואל ע״ה נלב״ע כ׳ שבט תשפ״ב",
  },
  {
    txt2: "הוקדש על ידי משה מוטי משעלי",
    id: uuidv4(),
    txt1: "לעילוי נשמת ז׳נט בת סולטנה",
  },
  {
    txt2: "הוקדש על ידי בנה עמית נימני",
    id: uuidv4(),
    txt1: "לזכות נורמה בת מסעודה לבריאות איתנה ואריכות ימים ושנים טובות",
  },
  {
    txt2: "הוקדש על ידי יעקב רזמוביץ",
    id: uuidv4(),
    txt1: "לעילוי נשמת חיים שמואל בן מנחם מנדל ולעילוי נשמת רינה בת רומיה",
  },
  {
    txt2: "הוקדש על ידי שגב דגן",
    id: uuidv4(),
    isTooLong: true,
    txt1: "לעילוי נשמת חנה בת חיה מרים לושק ז״ל,ולעילוי נשמת בני משפחתי אשר נרצחו בשואה, שלמה ברגמן בן מנשה ושרה,ישעיהו רובין בן נפתלי ושיינדל,דוד ברגמן בן מנשה ושרה, מאיר קלטר בן לייביש וצביה, ולול קלטר בן לייביש וצביה, סימה רוטן בת ולול וטוייבה שיינדל, דוב רוטן בן ולול וטוייבה שיינדל, גולדה דלמן בת שיינדל, סימה הילפר, ירחמיאל לושק בן אברהם ורוזה, לייביש לושק בן ירחמיאל וחיה מרים, חיה מרים לושק בת לייביש וציביה, ברנצ׳ה רוטן בת ולול וטוייבה שיינדל",
  },
  {
    txt2: "הוקדש על ידי ליאת קמינסקי",
    id: uuidv4(),
    txt1: "לעילוי נשמת חנן מטסרו בן הלנה",
  },
  {
    txt2: "הוקדש על ידי עופר פרץ",
    id: uuidv4(),
    txt1: "לעילוי נשמת יהודה בן שלביה",
  },
  {
    txt2: "הוקדש על ידי שמואל בללי",
    id: uuidv4(),
    txt1: "לעילוי נשמת יוסי גרשון בן אנה",
  },
  {
    txt2: "הוקדש על ידי בת אל בכבוד",
    id: uuidv4(),
    txt1: "לעילוי נשמת יוסי יוסף בן עדה",
  },
  {
    txt2: "הוקדש על ידי שלומי ונעמה בללי",
    id: uuidv4(),
    txt1: "לעילוי נשמת יוסף גרשון ז״ל",
  },
  {
    txt2: "הוקדש על ידי משה ומאיה טווינה",
    id: uuidv4(),
    txt1: "לעילוי נשמת יצחק בן הלה למשפחת טווינה",
  },
  {
    txt2: "לעילוי נשמת כדיה בת אברהם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי תומר בוארון",
    id: uuidv4(),
    txt1: "לעילוי נשמת לאה בוארון בת זהייה ז״ל",
  },
  {
    txt2: "הוקדש על ידי רחלי אליהו",
    id: uuidv4(),
    txt1: "לעילוי נשמת ליאור בן חיים צבי אליהו",
  },
  {
    txt2: "הוקדש על ידי שלמה דומני",
    id: uuidv4(),
    txt1: "לעילוי נשמת מור אבי יעקב בן שיפרא",
  },
  {
    txt2: "הוקדש על ידי שרה דרורי",
    id: uuidv4(),
    txt1: "לעילוי נשמת מנחם מנדל בן חיים שמואל ז״ל ולזכות שרה בת רבקה וסייעתא דשמיא לכל משפחת דרורי ובני ביתם בכל מכל כל",
  },
  {
    txt2: "הוקדש על ידי אמיר חנצ׳נסקי",
    id: uuidv4(),
    txt1: "לעילוי נשמת מנחם צבי בן חיים מרדכי. לבריאות, שמחה, הצלחה ובשורות טובות נעמה בת ציפורה ואמיר חיים בן מרים מלכה ומשפחותיהם",
  },
  {
    txt2: "הוקדש על ידי חפציבה גלט",
    id: uuidv4(),
    txt1: "לעילוי נשמת מרים בת חסיבה ואדוארד בן שמחה",
  },
  {
    txt2: "הוקדש על ידי תומר מנור",
    id: uuidv4(),
    isTooLong: true,
    txt1: "לעילוי נשמת משה כהן בן כמונה, שושנה כהן בת דג׳יריה ויעקב מרזוק בן עליזה. להצלחת שלומית חיון בן מיכל. להצלחת משה תומר מנור בן כרמלית. לרפואת מרסל מרזוק בת פורטונה. להצלחת מאיר מנור בן מרסל. להצלחת כרמלית מנור בת שושנה. להצלחת נועם מנור בן כרמלית. להצלחת עדן מנור בת כרמלית",
  },
  {
    txt2: "הוקדש על ידי נאור טדרי",
    id: uuidv4(),
    txt1: "לעילוי נשמת משה נחתומי ",
  },
  {
    txt2: "הוקדש על ידי בתאל מזרחי",
    id: uuidv4(),
    txt1: "לעילוי נשמת ניר עמיחי בן ארץ ",
  },
  {
    txt2: "לעילוי נשמת עדי מעוז ז״ל בן אורנה ומשה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי משה טוינה",
    id: uuidv4(),
    txt1: "לעילוי נשמת עזיזה בת סלחה",
  },
  {
    txt2: "הוקדש על ידי רחל זלמן",
    id: uuidv4(),
    txt1: "לעילוי נשמת ציון סימנה בן רחל וציון מלכה בן אודט",
  },
  {
    txt2: "הוקדש על ידי ליאור אלקיים",
    id: uuidv4(),
    txt1: "לעילוי נשמת ציפורה בת מזל",
  },
  {
    txt2: "הוקדש על ידי שלמה עזריאל",
    id: uuidv4(),
    txt1: "לעילוי נשמת ר׳ יוסף בר מסעודה ז״ל נלב״ע ח׳ שבט תשנ״ט. חנה בת שמחה ז״ל נלב״ע י״א אב תש״פ. עליזה (מסעודה) בת חנה ז״ל נלב״ע י״ב כסלו תשפ״ב ת.נ.צ.ב.ה",
  },
  {
    txt2: "הוקדש על ידי חגית בודן",
    id: uuidv4(),
    txt1: "לעילוי נשמת רבקה בת מזל ויעקב ת.נ.צ.ב.ה",
  },
  {
    txt2: "לעילוי נשמת רועי שינברגר בן אמנון ואסתר שינברגר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש ברוך וזהורית צפירה",
    id: uuidv4(),
    txt1: "לעילוי נשמת רות בת פרידה ותיאו (תיאודור) בן פרידה",
  },
  {
    txt2: "הוקדש רונן הלל",
    id: uuidv4(),
    txt1: "לעילוי נשמת שולמית הלל בת שלמה",
  },
  {
    txt2: "הוקדש על ידי שמואל סלמון",
    id: uuidv4(),
    txt1: "לעילוי נשמת שושנה בת יפה (נפטרה ב- כ״ט טבת תשע״ג)",
  },
  {
    txt2: "הוקדש על ידי מזל סולימן",
    id: uuidv4(),
    txt1: "לעילוי נשמת שושנה בת מזל ויום טוב",
    txt11: " לעילוי נשמת צבי בן נג׳י וסלימה"
  },
  {
    txt2: "הוקדש על ידי טובי כהן",
    id: uuidv4(),
    txt1: "לעילוי נשמת שירה בת רבקה שיינדל",
  },
  {
    txt2: "הוקדש על ידי יעקב סרוסי",
    id: uuidv4(),
    txt1: "לעילוי נשמת שלום בן מרים",
  },
  {
    txt2: "הוקדש על ידי בני סניידר",
    id: uuidv4(),
    txt1: "לעילוי נשמת שמואל בן דורה",
  },
  {
    txt2: "הוקדש על ידי נחלה זילברמן",
    id: uuidv4(),
    txt1: "לעילוי נשמת שמואל בן שרה",
  },
  {
    txt2: "הוקדש על ידי שרון עוזיאל פלד",
    id: uuidv4(),
    txt1: "לעילוי נשמת שמחה עוזיאל בת מזל מתילדה",
  },
  {
    txt2: "הוקדש על ידי חיים קפלן",
    id: uuidv4(),
    txt1: "לעילוי נשמת שמעון בן הירש לייב הלוי נלב״ע ט׳ ניסן תשע״ח. שלמה בן נחום הלוי נלב״ע ה׳ טבת תשע״ט. ת.נ.צ.ב.ה",
  },
  {
    txt2: "הוקדש על ידי ירון סויסה",
    id: uuidv4(),
    txt1: "לעילוי נשמת שרה בת דוד",
  },
  {
    txt2: "הוקדש על ידי ארז ישרוף",
    id: uuidv4(),
    txt1: "לעילוי נשמת שרה גו׳רג׳ט בת דוד",
  },
  {
    txt2: "הוקדש על ידי קינן בר עוז",
    id: uuidv4(),
    txt1: "לעילוי נשמת שרית בת ציפורה ומשה",
  },
  {
    txt2: "",
    id: uuidv4(),
    txt1: "לעילוי נשמת אברהם גרשון בן יחזקאל ויעקב בן שמעון",
  },
  {
    txt2: "הוקדש על ידי אביטל חדד",
    id: uuidv4(),
    txt1: "לעילוי נשמת חנינה בת דיאמנטה, יוסף בן חנה, וורידה ורדה בת מרימה ויעקותא בת מרימה",
  },
  {
    txt2: "הוקדש על ידי עירית ולנסי-מאוקונן",
    id: uuidv4(),
    txt1: "לעילוי נשמת שרה בת אלישבע, יעקב (יאשה) בן לנה, לינדה בת אסתר, שלמה (אדמונד) בן באיה, ויקטוריה בת אסתר ויוסף בן שרה",
  },
  {
    txt2: "הוקדש על ידי הבת יעל בראון ארד, הבן ירון אושרי ובני המשפחה",
    id: uuidv4(),
    txt1: "לעילוי נשמתם של הורי בנימין וזהבה אושרי ז״ל",
  },
  {
    txt2: "הוקדש על ידי זלמן מנעולי קלמקה",
    id: uuidv4(),
    txt1: "לעילוי נשמתם של מנחם מנדל וזיוה מנעולי קלמקה",
  },
  {
    txt2: "הוקדש על ידי קרן וקנין",
    id: uuidv4(),
    txt1: "לעילויי נשמת אימי מורתי גאולה בת לאה ז״ל ",
  },
  {
    txt2: "הוקדש על ידי אייזלר ישראל ושירה",
    id: uuidv4(),
    txt1: "לרפואה שלמה ובריאות איתנה לנורית בת סוליקא ולהצלחת הילדים היקרים יובל, זיו חיים ושליו חנה",
  },
  {
    txt2: "הוקדש על ידי ליאת רפאל",
    id: uuidv4(),
    txt1: "לרפואה שלמה ושפע ברכה והצלחה ליהודה בן בלור וורדה בת יטי",
  },
  {
    txt2: "לרפואה שלמה ליונה חממה צוביירי בת ברוד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי יהב קריטי",
    id: uuidv4(),
    txt1: "לרפואת שמחה בת עליזה, אהרון בן רחל ועופר בן שרה",
  },
  {
    txt2: "לרפואת בעלי ולרפואתי השלמה במהרה מיכאל מנחם בן חנה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אסתי אבני",
    id: uuidv4(),
    txt1: "לרפואת הדס בן דליה",
  },
  {
    txt2: "הוקדש על ידי אורן צוברי",
    id: uuidv4(),
    txt1: "לרפואת הוריי רפאל בן שרה ויונה בת אסתר",
  },
  {
    txt2: "הוקדש על ידי שיראל רווח",
    id: uuidv4(),
    txt1: "לרפואת הרב זאב חי בן גולדה הניה",
  },
  {
    txt2: "לרפואת והצלחת משפחת ראובן רבתי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי ליטל צבן",
    id: uuidv4(),
    txt1: "לרפואת יוסף וציפורה בן ובת טיטה לרפואה שלמה במהרה בע״ה",
  },
  {
    txt2: "הוקדש על ידי צורי זיגדון",
    id: uuidv4(),
    txt1: "לרפואת יוסף זגדון בן גיטה ולרפואה והצלחה אופק בן מלי",
  },
  {
    txt2: "הוקדש על ידי נדב גורמן",
    id: uuidv4(),
    txt1: "לרפואת יצחק מאיר בן ברוך",
  },
  {
    txt2: "הוקדש על ידי ניסים אבוטבול",
    id: uuidv4(),
    txt1: "לרפואת לינדה בת סוזן, ענבר בת לינדה, שושנה בת חביבה ואביבה בת שושנה, רפואת הנפש ורפואת הגוף בכלל כל חולי עמו ישראל",
  },
  {
    txt2: "הוקדש על ידי איתן שדה",
    id: uuidv4(),
    txt1: "לרפואתו השלמה של שלמה בן יפה ולרפואת ורד בת אורנה בתוך שאר כל הזקוקים לישועה",
  },
  {
    txt2: "מוקדש לזכות קהילת חברים SG , לזכות כל אחד ואחת , החברים בקהילה וב״ב שיחיו לבריאות , שמחה , אושר ועושר , בגשמיות וברוחניות , אכי״ר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי אברהם קאופמן",
    id: uuidv4(),
    txt1: "מוקדש לעילוי נשמות יצחק ודינה קאופמן ז״ל",
  },
  {
    txt2: "לזכות משפחת סוטחי חובב, נחמה ואהרון מנחם. ברכה בגשמיות וברוחניות ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי מירב חיים",
    id: uuidv4(),
    txt1: "לעילוי נשמת נעומי בת מסודי ז״ל ויוסי בן נעומי ז״ל",
  },
  {
    txt2: "הוקדש על ידי איציק ועדי עמר",
    id: uuidv4(),
    txt1: "נתרם לרפואה שלמה ולהצלחת יצחק בן יפה, עדי בת פאולינה, הודיה אסתר בת עדי, אביגיל הדסה בת עדי ושרה אורה בת עדי",
  },
  {
    txt2: "סיון טוּבּא בת איטה עידית לזרע חיה וקיימא",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות סמדר וג׳יי קופייצקי",
    id: uuidv4(),
    txt1: "In Honor of Smadar and Jay Kupietzky",
  },
  {
    txt2: "הוקדש על ידי דבורה אביגד",
    id: uuidv4(),
    txt1: "עוז אברהם בן דבורה לזיווג. דבורה בת חממה יונה לבריאות הגוף והנפש. שמואל בן ציפורה לבריאות",
  },
  {
    txt2: "הוקדש על ידי עזרא עובדיה עבוד",
    id: uuidv4(),
    txt1: "לעילוי נשמת הוריי- עובדיה וחנה עבוד ז״ל. ולעילוי נשמת שרה יהודית, רחל ושמואל עבוד ז״ל, בני חנה ועובדיה עבוד ז״ל",
  },
  {
    txt2: "לזכות עינת (נתי) וישראל חרמ״ץ , אורנית .",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי רוית ואריה שטיין",
    id: uuidv4(),
    txt1: "לעילוי נשמת שרה סאלי בת ליטמן ז״ל",
  },
  {
    txt2: "הוקדש על ידי רונית ומשה יוסף הלטובסקי",
    id: uuidv4(),
    txt1: "לעילוי נשמת אבי- גדעון בן יעקב הלטובסקי וכן לעילוי נשמת התינוקת טוהר בת ורד ושמואל (מולי) חיים אסא",
  },
  {
    txt2: "לזכות רן וקארן ראובן בברכת פרנסה ובריאות להם ולילדיהם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "רפואה שלימה לנסים בן מזל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי נהוראי כהן",
    id: uuidv4(),
    isTooLong: true,
    txt1: "רפואה שלמה: שמעון בן פרידה, צביה בת חממה, אלי בן זוהרה, ג׳ולייט בת מרים, חנה בת ג׳ולייט ואבא בן עלושה לעילוי נשמת: חממה בת שמחה, זוהרה בת יחיה, שלמה בן סעיד, אברהם בן חווה, שמעון בן מסעודה, עלושה בת זקנה וזרח בן אסתר הצלחה וזיווג: רעות עליזה בת חנה לזיווג הגון. נהוראי מאיר וחן כהן להצלחה בחיים שמחה ושלום בית",
  },
  {
    txt2: "תרומת ד״ר דביר קוה ומשפחתו לע״נ הסבים והסבתות דוד בן מרדכי וברכה, צפורה בת משה ולאה, מרדכי בן יהושע וריזל, זיסל בת משה ורבקה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "תרומת סבנו וסבתנו שיחי דשה וסמיון ציבקין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי עדנה וחיים פוקס",
    id: uuidv4(),
    txt1: "לעילוי נשמת אמי מורתי פסיה בת יצחק-מאיר לבית מצנר ולעילוי נשמת אבי מורי אליהו בן קרול פוקס ולנשמות משפחותיהם שניספו בשואה",
  },
  {
    txt2: "הוקדש על ידי שלמה יוסף ומרים מושקא זייאנץ",
    id: uuidv4(),
    txt1: "Dedicated with Love by Shloime and Mushky Zionce",
  },
  {
    txt2: "לזכות אייל ארד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "514523117 לזכות ממאש הרשת ח.פ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אבי חלפון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אבי יוסף חי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אבי מהרט",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אבי קרקו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אבי רוזנווסר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אבי שאולזון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אביטל עוזרי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אבנר חיימוב",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אברהם בושרי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אברהם יהודה גרינולד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אברהם יצחק קלר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אברהם לייבוביץ׳",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אברהם לררלין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אהרון משה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אודיה מוריה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אודליה לוריא",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דוד כהן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אופיר ליאור",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אופק שרון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אורי אשר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אורי גבאי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אורי וינברגר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אוריאל קדמון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אורן אליה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אושרי אזולאי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אזולאי אבי ומרים",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות איילה סמוטריץ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אילנה בן שיטרית",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אילנית קויפמן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי איריס ג׳ורג׳י",
    id: uuidv4(),
    txt1: "לעילוי נשמת שלמה בן ז׳מול",
  },
  {
    txt2: "לזכות איתמר שר שלום",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות איתן עיני",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלוילי שחר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלון ברקוביץ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלון ונק",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלון נפתלי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אליהו אשכנזי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלימלך דוד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלירן ומאיה אוחנה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלכס רצקובסקי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלמוג חוזה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אלקנה אסולין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אמונה שלם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אמיר דרטלר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אמיר היימן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אסף וורד דיין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אסף ונונו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ארז אליס",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אריאל אוחיון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אריאלה אפלבאום",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אשר אביעד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות אשר פז",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות בן ציון ולאה ליפסקר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות בנימין זאב וילהלם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות בע״מ וילה פרסום",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות בע״מ טנא",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות בר-דוד ניסים",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות בראון שלמה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ברק כהן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות גבאי מוטי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות גבי ברוך",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות גבי יעיש",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לעילוי נשמת שושנה בת רחל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות גל גזית",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות גל שרה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דוב בער אורגד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דוב בעריש כהן הלפרין",
    id: uuidv4(),
    txt1: "",
  },

  {
    txt2: "לזכות דוד יעקוביאן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דוד מוצפי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דוד שולמן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות הדוט נט בע״מ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דורית סוכר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דותן יעיש",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דיויד ורחל פריד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דיין אבשלום",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דינה פבזנר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דן גולדברגר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דניאל אוחיון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דניאל הלוי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דניאל יוגאי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דניאל קסלמן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות דניאלה חיה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות הוכבוים גיל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות הילה ונועם יאיר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות הילה מנדלברג",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות הירשהורן אלי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות הני פבזנר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות הרב גרשון יצחקי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות הרב עקיבא כץ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות הרץ אברהם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות זיו אור",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות זעירא לירז",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חב״ד צ׳אנג מאי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חגית בן שאנן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חגית הררי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חוות יריחו בע״מ צחי בן עטיה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חיה בן שמואל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חיים בן חיים",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חיים הראל ונעמה מרגלית",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חליו שחר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חן ושרה פרסיקו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות חנן אלקסלסי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות טובה מליחי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות טוני לוי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "אביטל וטל עזרא",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות טליה שלומי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יהודה בונפד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יהודית שטרן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יובל וחנה הלנה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוחאי טויטו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוחאי נתן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוני אזולאי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוסי בוחניק",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לעילוי נשמת אסתר חיים (מזרחי) בת אהובה ומנשה נפטרה ח׳ באלול תשס״ט ולעילוי נשמת אליהו חיים בן יוסף ורחל נפטר ג׳ אדר תשכ״א",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוסי מרטו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוסי שלום",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוסף אסף",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוסף זק״ש",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוסף מתנה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוסף נחמן סגל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יניב ורינת כרמי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יסמין יצחק פור",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יעל משעי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יעקב אלוני אל-רז ג׳נסיס בע״מ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יעקב נחמני",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יעקב שחר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ישי שרף",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ישראל קניג",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות כהן עזרא",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות כהן-פסריאן מרים",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות כפיר ואורית קצובר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות כפיר מליחי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות לורן ניסים- לורניס טורס",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ליאור ברקת",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ליאור קדוש",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ליזה אוזן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות לייה נאור",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ר׳ עוזר אלפרוביץ ומשפחת- לכיש טורס",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מאור אפרתי- האפרסמון בית תוכנה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מאיר גולדשטיין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מאיר ושלי גינזבורג",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מאיר ליברטי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מאיר מיכאל שרביט",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מורד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "מורן דגן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מיכאל לוי- יבוא ויצוא סובב עולם בע״מ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מיכל רווח",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מירב עוזרי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מנדי פישר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מני ווגובסקי",
    id: uuidv4(),
    txt1: "",
  },

  {
    txt2: "לזכות מנס יעקב",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מעוז דביר-אבנר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מעיין ודוב ולצ׳ר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מעיין סעדון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מרדכי (מוטי) אוחיון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מרים יצהרי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מרים מרדכי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מרכז הפעמון בע״מ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משה בלייש",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משה בן חמו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משה ופזית",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משה כאהן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משפחת לוין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות משפחת רימון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מתן קופר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נבו דובי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נדב אבי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נדב שטראלבר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נובה בטון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נועה ברכה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נועם באור",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נחמה דינה ווילהלם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נחמיה ינון כהן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נידם משה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נילי פרדיאן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ניסן בן יהודה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נקר סתיו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נריה לייבוביץ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נתי ושני שמיע",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נתי לוי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נתן ציבין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נתן שרעבי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נתנאל אברהם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נתנאל כהן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות נתנאל מרציאנו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יוסי ועדינה גרינפלד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות יהונתן בן סימון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות סלין ומאוריס הרשקו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עדי איטח",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עדן דהן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עודד אלפסי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עודד בזרנו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עומרי גוטפלד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עופר וסמדר פרגר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עליזה כהן נאמן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות עמית בר מסדה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ענקי אמיר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ענת ומאור כהן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ערן קוזניצקי- שירותי ניהול בע״מ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות פיילויאל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות פלג מוסקוביץ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות פנינית דיקשטיין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות פנינת ינאי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות פתחיה וינשטיין",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות צבי נעים",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות צבי פלורנטל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות צבייה איבס",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות צביקה ליפסקר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות צוברי משה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות צור אליאב",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות צחי וספיר בלה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ציפי מנהיימר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות ק״ק אירקוטסק רוסיה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות קליין מנחם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות קרולין ופטריק לנדאו",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות קרמר מיכל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות קרן אופיר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רבקה וחיים לביוב",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רבקה סימון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רוימי דותן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רונן אברגל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רונן ונירית פלד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רועי טופז",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רחל ידיד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רחמים שרעבי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רייניץ יוסי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רן עובד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רפי וטליה אטיאס",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות רפפורט נועם",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שי אילנד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שי אסף",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שי טופז",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שייקה שטייגל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שילון פיתוח ויזמות בע״מ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שלום ברוכים",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שלום גולדשמיד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שלמה אפלר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שמואל מקובצקי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שמחה הקטר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שמעון סיבוני",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שמרית ידסי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שניאור סגל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "הוקדש על ידי שניאור שטיינברג",
    id: uuidv4(),
    txt1: "לעילוי נשמת ברוך בן בתיה ורבקה רחל בת חיה מינה כץ",
  },
  {
    txt2: "לזכות שרה גל",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שרה מיארה",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שרון בן שושן",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שרון דרור",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שרון ליבר",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות שרית חדד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות תהילה אורבי",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות מאיר אוחנון",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Henry Wyman",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "לזכות בת חן חדד",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Adina Stone",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Avraham Davidshvili",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Burt Samuelson",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Chaim Drizin",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Chaim Lipszyc",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Dornbusch",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Eddie Yair",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Eliyahu Gorgov",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Jacob Kadosh",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Joel Fhima",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Joseph Slater",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Joshua & Vera Guttman TZ",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Karen Pichel",
    id: uuidv4(),
    isTooLong: true,
    txt1: "In memory of my paternal great grandmother Clara Lassoff. May her memory be blessed. In memory of my maternal greatgrandmother Sadie Seligman. In memory of my maternal grandparents Esther and Lou Dennis . May their memory be blessed. In memory of my paternal grandmother Blanche Lassoff Pichel Blanche bat Menachem Mendel. May her memory be blessed. In loving memory of my dear friend Chavi Chamish. In loving memory of my cousins who left this world too soon- Kim Deckelbaum and Judy Deckelbaum.",
  },
  {
    txt2: "In Honor of Kevin C Lefco",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Ori Oron",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Rahamim Dabush",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Ronny Rozental",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Ruben Rotenberg",
    id: uuidv4(),
    txt1: "",
  },
  {
    txt2: "In Honor of Shmuel Lipszyc",
    id: uuidv4(),
    txt1: "",
  },
];
